[
  {
    "chunk_id": "e7f6b90b-33a1-42fd-8912-6e28a5fffa8a",
    "title": "Getting Started",
    "url": "https://help.appeq.ai/en/articles/10421167-getting-started",
    "text": "Welcome to AppEQ.ai! Follow these steps to get started and unlock the full potential of our platform. 1. Sign Up for AppEQ.ai Visit AppEQ.ai and sign up using your work email. Ensure all team members register with the same email domain (e.g - if your domain is acme.com, then let all your team members sign up using email from that domain) to be grouped under a single tenant. 2. Install the AppEQ Chrome Extension Download and install the AppEQ Chrome Extension from the Chrome Web Store. After installation, pin the extension for easy access. Log in Using AppEQ's SuccessPad : Access AppEQ's SuccessPad, a compact widget that appears directly in your browser. You can log in quickly using either a passcode or Google authentication. 3. Explore the Preloaded Workspace Take a tour of the preloaded Workspace to see how the CSM and Manager Workbench are structured. This hands-on preview provides valuable insights into how the workbench can be tailored to support your team's workflows effectively. 4. Integrate Your Data Log in to your AppEQ.ai account. Navigate to the 'Integrations' section. Select your desired data sources and follow the prompts to connect them. 5. Contact AppEQ team as shown below for a onboarding session. Drop a note to support@appeq.ai Start a conversation using below chat icon AppEQ Customer Success + Solution Architect will understand your requirements to help set up the workbench for your team. This process generally takes anywhere between 3-14 days depending on the complexity of your data and requirements. By completing these steps, you'll be well on your way to leveraging AppEQ.ai to its fullest potential. Related Articles Your Quick Guide to installing and signing up on AppEQ.ai AppEQ Analytics SDK Integration Guide"
  },
  {
    "chunk_id": "a5df2b35-5855-49fe-9c90-15b9d3687db4",
    "title": "Getting Started",
    "url": "https://help.appeq.ai/en/articles/10421167-getting-started",
    "text": "requirements. By completing these steps, you'll be well on your way to leveraging AppEQ.ai to its fullest potential. Related Articles Your Quick Guide to installing and signing up on AppEQ.ai AppEQ Analytics SDK Integration Guide"
  },
  {
    "chunk_id": "85be5ccc-f21d-46b0-86eb-764c9ec5fcc8",
    "title": "Your Quick Guide to installing and signing up on AppEQ.ai",
    "url": "https://help.appeq.ai/en/articles/10031487-your-quick-guide-to-installing-and-signing-up-on-appeq-ai",
    "text": "Table of contents We’re excited to have you on board at AppEQ.ai! This guide will walk you through your first steps to install AppEQ.ai. By the end, you’ll be ready to unlock the full potential of our platform. Step 1: Installing the AppEQ.ai Extension To dive into the magic of AppEQ.ai, the first thing you’ll need to do is install our browser extension. These simple steps ensures that you can seamlessly integrate AppEQ.ai into your daily workflow. How to Install the Extension: 1. Head to the Chrome Web Store link: https://bit.ly/EQ_Ext . 2. Click on “ Add to Chrome ”. 3. Once installed, you’ll see the AppEQ.ai icon appear in your browser toolbar. This is your gateway to more efficient customer success management! Step 2: Launching AppEQ.ai Now that the extension is installed, the AppEQ.ai interface will start appearing automatically while you work within your CRM, sales, or support tools. It’s designed to pop up right where you need it, without disrupting your workflow. You’re never more than a click away from essential insights. Step 3: Login – Quick and Easy To access AppEQ.ai, log in using OTP (One-Time Password) or Google Login. Here’s how you can get started: • OTP Login: 1. Enter your work email ID. 2. You’ll receive a unique OTP in your inbox. 3. Enter the OTP and click “Submit.” Voilà! You’re in. • Google Login: 1. Click on “Login with Google.” 2. Select the Google account you wish to use. 3. And that’s it, you’re ready to go! Why use OTP or Google Login? We’ve kept our login process simple and secure so you can start using AppEQ.ai without the hassle of remembering yet another password ensuring you’re up and running in no time. Ready to Revolutionize Your Workflow? With these three easy steps, you’re"
  },
  {
    "chunk_id": "4eb95d10-fb89-4b62-8c97-7d825a39372c",
    "title": "Your Quick Guide to installing and signing up on AppEQ.ai",
    "url": "https://help.appeq.ai/en/articles/10031487-your-quick-guide-to-installing-and-signing-up-on-appeq-ai",
    "text": "ready to go! Why use OTP or Google Login? We’ve kept our login process simple and secure so you can start using AppEQ.ai without the hassle of remembering yet another password ensuring you’re up and running in no time. Ready to Revolutionize Your Workflow? With these three easy steps, you’re have signed up and is ready to explore all the powerful features AppEQ.ai has to offer. AppEQ.ai is here to make your customer success journey smoother and more efficient. Need assistance? Our support team is just a click away. Welcome aboard, and here’s to your success with AppEQ.ai! Related Articles Getting Started"
  },
  {
    "chunk_id": "8f6cb8ea-22ef-4737-8e97-1164bd2c5f1d",
    "title": "AppEQ Product - Overview",
    "url": "https://help.appeq.ai/en/articles/8019840-appeq-product-overview",
    "text": "AppEQ product can be broadly broken down into below features. Feature Description Widgets Widgets as UI components that get activated on top of your existing applications to help your team to get contextual access to data, insights and action items for your customer accounts. AppEQ support 3 widgets - Summary, Feed and SuccessPad. Data This helps in getting enterprise data from your existing system like CRM, Helpdesk, Spreadsheet to be sync with AppEQ so that you can use them for designing the widget and signals. You can also configure derived data based on existing data. Signals Signals are notifications and tasks that helps your team to be proactive. You can configure nudges notification and play-books for your team based on certain condition. Configuration of right signals enable your team to be more proactive and improve the odds for higher revenue retention and growth. Widgets Summary Widget : This widget helps you to configure crisp executive summary of the account which can be useful for your customer success managers or account managers. Feed Widget : This widget helps you to see filtered list of items like open tickets, pending invoices etc. Priority Accounts Feed : This help your team to understand the list of priority accounts for the day. It allows CSM or AM to understand which accounts to focus from their portfolio of accounts. It is a widget which can be activated on web applications where CSM or AM already works on. Through this, a CSM when he/she starts the day, will see their accounts based on the priority and nudges associated with the account. This will help CSM to focus on accounts which require proactive focus. ​ Filtered List : This helps to see and access data across accounts by each business object. E.g - List of all the"
  },
  {
    "chunk_id": "ba0a89a3-e244-410e-af8e-5fccfe30b958",
    "title": "AppEQ Product - Overview",
    "url": "https://help.appeq.ai/en/articles/8019840-appeq-product-overview",
    "text": "day, will see their accounts based on the priority and nudges associated with the account. This will help CSM to focus on accounts which require proactive focus. ​ Filtered List : This helps to see and access data across accounts by each business object. E.g - List of all the open P1 issues in my accounts. Nudges : List of items which I need to look at , applicable for a given condition. SuccessPad Widget : This is a draggable widget which can be enabled on web applications where you team works currently. This will give them access to data and insights for their accounts. Data Data Source : Data source are applications which store information to understand for customer accounts. E.g - If you use a CRM like Salesforce, it become a good source of data to understand opportunities, engagement etc. Similarly - a Helpdesk software like Zendesk becomes a good source to understand customer account from support perspective. You can configure to connect your enterprise applications to connect with AppEQ to have real-time sync with the systems to understand customer insights. CRM - Salesforce, Hubspot Helpdesk - Zendesk, Freshdesk, Hubspot Google Spreadsheet API Interface - your team can send account metrics through AppEQ api at regular interval. Custom Field : You can also define custom fields based on formula. E.g - Annual Non Recurring Revenue = TCV - ARR Signals Account Red Condition : Based on the data source configured, you can configure threshold to understand RED accounts. Nudges Notification : Based on account scenario, you can configure notifications so that your team will not miss the right events of critical accounts. Nudges Playbook : Based on account scenario, you can not only configure notifications but also add TODOs for the account. Related Articles Data Integration with AppEQ"
  },
  {
    "chunk_id": "b467a080-6f76-489e-9948-414da37e3591",
    "title": "AppEQ Product - Overview",
    "url": "https://help.appeq.ai/en/articles/8019840-appeq-product-overview",
    "text": "Nudges Notification : Based on account scenario, you can configure notifications so that your team will not miss the right events of critical accounts. Nudges Playbook : Based on account scenario, you can not only configure notifications but also add TODOs for the account. Related Articles Data Integration with AppEQ August'23 Release Notes Account Custom Fields Email Assist Navigating Customer Success: Understanding Account Pulses vs. Account Health"
  },
  {
    "chunk_id": "332d1cbe-611c-4198-a7a1-6206084c4d16",
    "title": "Dashboards",
    "url": "https://help.appeq.ai/en/articles/10511549-dashboards",
    "text": "Table of contents Exploring AppEQ's NoSQL-Powered Dashboard 1. Introduction AppEQ's dashboard is designed to help Customer Success, Revenue, and Operations teams gain real-time insights into key business metrics without requiring extensive data expertise. By leveraging NoSQL (MongoDB) and Metabase-powered visualizations , AppEQ provides a seamless, self-service analytics experience. With AppEQ, teams can: Monitor customer health, revenue trends, and product adoption Visualize data in multiple chart formats Reduce manual effort in preparing reports for QBRs and internal meetings Leverage AI-driven insights for proactive decision-making This document introduces NoSQL, explains AppEQ’s data dictionary, and outlines the supported visualizations to help users make the most of their data. 2. Understanding NoSQL and MongoDB What is NoSQL? NoSQL databases are designed to handle large-scale, unstructured, or semi-structured data in a flexible manner. Unlike relational databases (SQL), which use fixed schemas, NoSQL databases like MongoDB allow dynamic and scalable data storage. Why MongoDB for AppEQ? AppEQ uses MongoDB , a document-based NoSQL database, due to its: Scalability – Handles large data sets efficiently. Flexibility – Supports dynamic schema structures. Real-time capabilities – Enables instant data visualization. JSON-like document storage – Simplifies integration with external data sources. For a deeper dive into NoSQL and MongoDB: MongoDB Official Documentation Introduction to NoSQL Databases 3. AppEQ's Quick Chart & Data Dictionary Quick Chart Feature AppEQ's Quick Chart feature enables teams to generate visualizations effortlessly using natural language inputs. This eliminates the need for SQL or NoSQL query writing, making data insights accessible to non-technical users. How Quick Chart Works Users enter a query in plain language, such as: \"Give me a trend of tickets for the account Tesla for the last 3 months.\" AppEQ translates this input into the necessary NoSQL query. The generated query retrieves data from MongoDB. The appropriate visualization (e.g., a line chart for trends)"
  },
  {
    "chunk_id": "e7f63d90-37aa-4c8f-b30e-69146acab037",
    "title": "Dashboards",
    "url": "https://help.appeq.ai/en/articles/10511549-dashboards",
    "text": "Works Users enter a query in plain language, such as: \"Give me a trend of tickets for the account Tesla for the last 3 months.\" AppEQ translates this input into the necessary NoSQL query. The generated query retrieves data from MongoDB. The appropriate visualization (e.g., a line chart for trends) is displayed on the dashboard. Benefits of Quick Chart Time-Saving : Eliminates the need for manual query writing. User-Friendly : Allows non-technical users to access data insights. Accuracy : Ensures consistency in data retrieval and visualization. Seamless Integration : Works across different business data sources. What is a Data Dictionary? A data dictionary provides a structured overview of the business objects and their corresponding fields that AppEQ pulls from external sources like CRM, billing, and support systems. This ensures consistent data mapping for visualization. Key Business Objects & Sample Fields Business Object Source Sample Fields Customer Account CRM (HubSpot, Salesforce) Account Name, MRR, ARR, Owner, Industry Product Usage Analytics (Mixpanel, Amplitude) Active Users, Feature Adoption, Session Duration Support Tickets Helpdesk (Zendesk, Freshdesk) Ticket ID, Priority, Status, Resolution Time Financial Data Billing (Chargebee, Stripe) Subscription Plan, Payment Status, Renewal Date This structured approach enables teams to quickly extract insights without manually aggregating data. 4. Supported Visualizations in AppEQ’s Dashboard AppEQ’s dashboard is powered by Metabase , offering a variety of chart types to help teams analyze data effectively. Supported Chart Types Chart Type Use Case 📊 Bar Chart Compare MRR growth, churn trends, or feature adoption rates 📈 Line Chart Track customer health scores, revenue expansion, or retention trends 🥧 Pie Chart Visualize customer segments, issue categories, or renewal statuses 🍩 Donut Chart Similar to pie chart but with an inner hole for emphasis 📉 Area Chart Show cumulative trends like user growth over time 📑 Table View Display detailed account,"
  },
  {
    "chunk_id": "242cf968-12a4-4fb1-9eaf-b7e24721d8b6",
    "title": "Dashboards",
    "url": "https://help.appeq.ai/en/articles/10511549-dashboards",
    "text": "customer health scores, revenue expansion, or retention trends 🥧 Pie Chart Visualize customer segments, issue categories, or renewal statuses 🍩 Donut Chart Similar to pie chart but with an inner hole for emphasis 📉 Area Chart Show cumulative trends like user growth over time 📑 Table View Display detailed account, usage, or support data in tabular format 📊 Combo Chart Combine multiple data series (bar + line) for deeper insights 📌 Funnel Chart Analyze customer journey stages from onboarding to renewal 📡 Radar Chart Compare multiple variables like CSAT, NPS, and response times For more details on Metabase visualizations: Metabase Visualization Documentation 5. How to Leverage the AppEQ Dashboard for Customer Retention, Upsell, and Cross-Sell Insights Step-by-Step Guide Connect external data sources (e.g., HubSpot, Salesforce, Mixpanel, Zendesk). Choose a visualization type based on the insights you need. Apply filters (e.g., revenue by region, churn by industry, active users by product feature). Customize dashboard layouts to suit team-specific needs. Export charts and reports for QBRs, executive presentations, or department meetings . By automating report generation, teams save time and improve decision-making with accurate, real-time data. 6. Advantages of Using AppEQ’s NoSQL Dashboard ✅ Real-time updates – No need for manual data exports. ✅ Self-service analytics . ✅ Scalability – Handles large datasets from multiple sources. ✅ Customization – Tailor dashboards for different teams (CS, Leaders, CSOps / SalesOps). ✅ Easy integrations – Works with HubSpot, Salesforce, Zendesk, Chargebee, Mixpanel, and more. 7. Next Steps AppEQ’s NoSQL-powered dashboard is designed to empower teams with real-time insights , eliminating the complexity of traditional BI tools. By integrating data from multiple sources and supporting a variety of visualizations, AppEQ enhances data-driven decision-making for Customer Success, Revenue, and Operations teams . For advanced visualizations or complex joins, you may need to write NoSQL queries to"
  },
  {
    "chunk_id": "8a5db566-cb88-40ce-a45c-a5f581a72a1c",
    "title": "Dashboards",
    "url": "https://help.appeq.ai/en/articles/10511549-dashboards",
    "text": "teams with real-time insights , eliminating the complexity of traditional BI tools. By integrating data from multiple sources and supporting a variety of visualizations, AppEQ enhances data-driven decision-making for Customer Success, Revenue, and Operations teams . For advanced visualizations or complex joins, you may need to write NoSQL queries to achieve the desired results. If you need assistance, our team of experts is always available to guide you through the process. Next Steps: 📘 Learn More : Explore AppEQ’s Knowledge Base. 📩 Get Support : Contact support@appeq.ai for custom dashboard requirements. Related Articles October 2024 Release Notes November 2024 Release Notes"
  },
  {
    "chunk_id": "55426fc6-5a50-4b42-bb61-44c8bbe39a33",
    "title": "Account Summary Feature",
    "url": "https://help.appeq.ai/en/articles/8290039-account-summary-feature",
    "text": "Related Articles SuccessPad Feature My Tasks Feature"
  },
  {
    "chunk_id": "58b72ab6-0de3-4bc5-98bc-d42db63b4d5f",
    "title": "SuccessPad Feature",
    "url": "https://help.appeq.ai/en/articles/8290046-successpad-feature",
    "text": "SuccessPad consolidates data from various applications into a single interface for seamless workflow management. With SuccessPad, you can access all account-related information, tasks, and insights in one place, eliminating the need to switch between multiple applications. You can customize the interface, set up early warning systems, and integrate different applications effortlessly. Take proactive actions, simplify your workflow, and enhance productivity with SuccessPad! Related Articles July 2024 Release Notes Dashboards"
  },
  {
    "chunk_id": "a3d11a54-769e-4f5d-9836-53630da6e92c",
    "title": "My Tasks Feature",
    "url": "https://help.appeq.ai/en/articles/8290066-my-tasks-feature",
    "text": "Related Articles Account Summary Feature"
  },
  {
    "chunk_id": "11086d93-71ae-4345-9e1a-12f4d06e42dd",
    "title": "Email Assist",
    "url": "https://help.appeq.ai/en/articles/9013085-email-assist",
    "text": "Email Assist feature helps Customer account owners to engage with customers over email with the right template assistance based on the email to be sent. For example, you would want to make a playbook to ensure that your CSM / AM sends out a Birthday greetings to all the budget owners with a hyper personalized email. Email Templates : Templates can be defined by admin or manager to standardise some of the email engagement. Such templates will be available to the CSM/AMs to assist them while sending out email to customer. There are 2 types of email templates that are supported. Static Templates with Variables Hyper Personalized CGPT Templates with Variables Static Templates Static templates are mostly static text which can be used to send out some of the standard customer communications. E.g - Sending out email reminder for pending invoice. Subject : Reminder: Outstanding Invoice Payment Due Dear {firstName}, I hope this email finds you well. I am reaching out to remind you about the outstanding invoice for {productName}, which is currently overdue. As your dedicated Account Manager, I understand the importance of ensuring that all financial matters are promptly addressed to maintain a smooth and mutually beneficial partnership. The invoice in question was due on {dueDate}, and we have yet to receive payment. Please kindly review your records and prioritize the settlement of this invoice at your earliest convenience. If you require any assistance or have any questions regarding the payment process, please do not hesitate to reach out to me directly. Thank you for your attention to this matter, and I look forward to your prompt action. Thanks and Regards, Hyper Personalized CGPT Templates CGPT templates are used to hyper personalize an email sent to a customer. Below is one example of a CGPT template for sending"
  },
  {
    "chunk_id": "b2e9c2ec-f4ef-435c-bcdb-418309c7da48",
    "title": "Email Assist",
    "url": "https://help.appeq.ai/en/articles/9013085-email-assist",
    "text": "out to me directly. Thank you for your attention to this matter, and I look forward to your prompt action. Thanks and Regards, Hyper Personalized CGPT Templates CGPT templates are used to hyper personalize an email sent to a customer. Below is one example of a CGPT template for sending out a B'day greeting. Generate a email to wish a birthday for a customer with below details Name : {firstName} Birthday : {birthday} Location : {city} Profile : {profileTags} Tone: Formal The above templates can be used by the CSM from AppEQ widgets manually or through Nudges & Playbook tasks automation."
  },
  {
    "chunk_id": "017f3958-7ce4-4c94-8bcc-38595fcd8efe",
    "title": "Setting Early Warning System with AppEQ",
    "url": "https://help.appeq.ai/en/articles/9524936-setting-early-warning-system-with-appeq",
    "text": "An effective early warning system allows your team to focus on strategic tasks while automatically monitoring potential issues that could impact account health. It helps you identify and address problems before they escalate, improving customer satisfaction and reducing churn. Setting up your early warning system: AppEQ allows you to configure alerts for various metrics that indicate potential issues. Here are some examples of early warning signals you can set up: 1. Ticket volume and priority: Be alerted when the number or severity of support tickets increases beyond a set threshold. 2. Customer responsiveness: Get notified if a customer hasn't responded to communications within a specified timeframe. 3. Business review schedule: Receive reminders when business reviews are overdue. 4. Key stakeholder changes: Be informed when a customer champion leaves the company or changes roles. 5. Usage patterns: Set alerts for significant drops in usage, no usage, or usage below the median for similar accounts. Remember, the key to an effective early warning system is finding the right balance. Set thresholds that catch genuine issues without overwhelming your team with false alarms. With AppEQ's Early Warning System, you'll always stay one step ahead, ensuring your customers receive timely attention and support when they need it most. Related Articles SuccessPad Feature Navigating Customer Success: Understanding Account Pulses vs. Account Health July 2024 Release Notes August 2024 Release Notes Early Warning System"
  },
  {
    "chunk_id": "f2f6e523-e064-4365-b463-aabbe7617895",
    "title": "Creating Playbooks with AppEQ",
    "url": "https://help.appeq.ai/en/articles/9524928-creating-playbooks-with-appeq",
    "text": "Playbooks ensure consistency, efficiency, and best practices across your entire customer success operation. They provide a structured approach to common scenarios, allowing your team to deliver a uniform, high-quality experience to every customer. When should you create a playbook? Create playbooks for recurring processes or situations that require a standardized approach. This could be at various stages of the customer lifecycle or for specific events that impact customer health and satisfaction. Types of playbooks you can create: 1. Customer Onboarding Playbook: Guide new customers through a smooth setup process. 2. Kickoff Playbook: Ensure a strong start to new customer relationships. 3. Business Review Playbook: Prepare and conduct effective periodic reviews. 4. NPS Review Playbook: Respond appropriately to customer feedback. By implementing playbooks, you ensure that all Customer Success Managers (CSMs) follow tried-and-tested best practices, leading to improved customer satisfaction and retention. Related Articles June'23 Release Notes August'23 Release Notes Email Assist Navigating Customer Success: Understanding Account Pulses vs. Account Health November 2024 Release Notes"
  },
  {
    "chunk_id": "f6ee5b63-90cd-487f-b664-d63f5a25b58e",
    "title": "Navigating Customer Success: Understanding Account Pulses vs. Account Health",
    "url": "https://help.appeq.ai/en/articles/9874287-navigating-customer-success-understanding-account-pulses-vs-account-health",
    "text": "Table of contents Mastering Customer Success with Account Pulses and Account Health In the world of Customer Success, understanding your clients' experiences, needs, and challenges is key to driving long-term relationships and success. But how do you capture the pulse of a client’s journey while staying on top of potential risks? This is where Account Pulses and Account Health come into play - two powerful tools that offer actionable insights to elevate your customer management strategies. Let’s take a closer look at these concepts and how they work together to ensure proactive, personalized customer success. Account Pulses: Capturing the Human Element Account Pulses are subjective indicators set by Customer Success Managers (CSMs) based on their day-to-day interactions and conversations with clients. Think of them as a quick temperature check- an intuitive, color-coded system that reflects the current sentiment or mood of an account. These pulses typically include the following color classifications: Green : Indicates positive product usage and feedback. Amber : Suggests caution or potential issues. Red : Signals significant concerns or low engagement. Purple : Customizable, used for specific internal purposes. ​ What makes Account Pulses unique is their ability to capture nuances in the customer journey that raw data might overlook. For instance, if a client is experiencing reduced product usage due to external market changes, the CSM can manually update the pulse to yellow, even if other engagement metrics are strong. This flexibility allows CSMs to adapt conversations and strategies in real-time to better support the client’s evolving needs. In essence, Account Pulses offer a momentary, human-centered snapshot of the client’s experience. They allow CSMs to keep their finger on the pulse (pun intended) and stay connected to the emotional and experiential aspects of the customer journey. Account Health: Data-Driven Risk Management While Account Pulses provide a"
  },
  {
    "chunk_id": "03000bf4-9fb2-47fb-9a54-d49028cdae2a",
    "title": "Navigating Customer Success: Understanding Account Pulses vs. Account Health",
    "url": "https://help.appeq.ai/en/articles/9874287-navigating-customer-success-understanding-account-pulses-vs-account-health",
    "text": "evolving needs. In essence, Account Pulses offer a momentary, human-centered snapshot of the client’s experience. They allow CSMs to keep their finger on the pulse (pun intended) and stay connected to the emotional and experiential aspects of the customer journey. Account Health: Data-Driven Risk Management While Account Pulses provide a qualitative, emotional view of customer sentiment, Account Health is a more structured, automated assessment based on predefined, data-driven metrics. Account Health evaluates whether an account meets certain health criteria, offering a more objective view of customer engagement and satisfaction. Common metrics used in determining Account Health include: - Product usage : Frequency and depth of usage over time. - Login activity : Days since the customer last logged in. - Net Promoter Score (NPS) : Customer feedback and satisfaction score. - Support tickets: Number and severity of open issues or requests. For instance, if a customer hasn’t logged into the platform for over seven days or their NPS score drops below a set threshold, their Account Health might be flagged as \"red,\" signaling that the account requires immediate attention. This automated, data-centric approach ensures consistency and accuracy in evaluating the status of an account, allowing CSMs to identify at-risk customers before issues escalate. The Power of Combining Account Pulses and Account Health The real magic happens when Account Pulses and Account Health work together. By combining the subjective insights from Account Pulses with the objective, data-driven analysis of Account Health, CSMs gain a holistic view of each customer’s journey. - Account Pulses allow for real-time, personalized adjustments based on direct communication with the client, ensuring that the CSM stays attuned to the emotional side of customer experience. - Account Health provides a consistent framework for tracking key performance indicators, identifying risks, and predicting potential churn before it’s too late. By"
  },
  {
    "chunk_id": "c39823f9-d8d2-4c9f-8181-f8b036d5ec4b",
    "title": "Navigating Customer Success: Understanding Account Pulses vs. Account Health",
    "url": "https://help.appeq.ai/en/articles/9874287-navigating-customer-success-understanding-account-pulses-vs-account-health",
    "text": "Account Pulses allow for real-time, personalized adjustments based on direct communication with the client, ensuring that the CSM stays attuned to the emotional side of customer experience. - Account Health provides a consistent framework for tracking key performance indicators, identifying risks, and predicting potential churn before it’s too late. By leveraging both tools, CSMs can tailor customer success strategies more effectively offering personalized support to clients while addressing data-driven risks. Proactive Customer Management: The Key to Long-Term Success In today’s competitive landscape, a reactive approach to customer success just won’t cut it. Organizations need to be proactive in managing customer relationships, and that’s where Account Pulses and Account Health shine. By regularly monitoring these two key indicators, CSMs can stay ahead of potential challenges, fostering stronger relationships and ultimately driving customer loyalty. To ensure long-term success, CSMs should: - Regularly review Account Health to track customer engagement and detect early warning signs. - Maintain close communication with clients to adjust Account Pulses and gain deeper insights into their experience. - Use both qualitative and quantitative data to shape customer success strategies, ensuring a balanced approach. Conclusion: Elevating Customer Success with Data and Empathy Account Pulses and Account Health are indispensable tools in the world of customer success. They empower CSMs to balance the art and science of customer management—combining data with empathy to provide personalized, proactive support. By harnessing the power of both, organizations can enhance customer satisfaction, reduce churn, and foster long-term success for their clients. Ultimately, understanding and utilizing Account Pulses and Account Health allows CSMs to elevate their customer management efforts and build lasting relationships that drive real, measurable business outcomes. Related Articles July'23 Release Notes How to enable API Access / Permission in Salesforce August'23 Release Notes August 2024 Release Notes November 2024 Release Notes"
  },
  {
    "chunk_id": "00607b7a-0467-4016-9482-3ea95933bcfe",
    "title": "Navigating Customer Success: Understanding Account Pulses vs. Account Health",
    "url": "https://help.appeq.ai/en/articles/9874287-navigating-customer-success-understanding-account-pulses-vs-account-health",
    "text": "utilizing Account Pulses and Account Health allows CSMs to elevate their customer management efforts and build lasting relationships that drive real, measurable business outcomes. Related Articles July'23 Release Notes How to enable API Access / Permission in Salesforce August'23 Release Notes August 2024 Release Notes November 2024 Release Notes"
  },
  {
    "chunk_id": "bb6e0f31-51e9-4784-bda8-5a6ef60971bf",
    "title": "How to configure Summary Widget",
    "url": "https://help.appeq.ai/en/articles/7046828-how-to-configure-summary-widget",
    "text": "Configure your Summary Widget Login to https://app.appeq.ai/ Go to the Widget Section Click on the Next Button Add Items to your summary Widget Choose from your Business Objects coming from Integrated Apps For instance, Tickets from Zendesk have Functions to summarize at the Customer Account level For instance, Customer Invoices from a Google Sheet have Functions to summarize at the Customer Account level You can set the Label for Items save your changes Once the Summary Widget is configured, you will start seeing the summary in the following Apps, basis your configuration. Summary Widget in your Existing Apps You can fetch the Summary on click on the Logo in the Feeds view On-click on the Customer Account Logo The summary Widget Pops up You can fetch the Customer Summary on top of your Inbox On-hover over the Health Icon with the Customer email The summary Widget Pops up You can fetch the Summary on top of your Apps like SFDC On-click on the Health Icon on your Customer Account Page on SFDCemail The summary Widget Pops up"
  },
  {
    "chunk_id": "8e74de15-9068-4fdb-a7fc-a0a77dea06d2",
    "title": "Understanding - \"Profile in AppEQ.ai\"",
    "url": "https://help.appeq.ai/en/articles/7958000-understanding-profile-in-appeq-ai",
    "text": "When it comes to managing applications, efficiency and tailored user experiences are paramount for success. AppEQ, our innovative platform, introduces a powerful tool called \"Profiles\" that allows businesses to organise and customise information for different user groups. In this article, we will explore what Profiles are in AppEQ and how they offer distinct summaries, empowering teams such as Customer Success, Finance, and Sales to access the information most relevant to their roles while keeping it separate from other profiles. What is \" Profile \" in AppEQ? A \" Profile \" in AppEQ refers to a distinct group or cohort that defines specific roles for users within the application. These profiles aid in the definition and assignment of responsibilities to various employees depending on their functions and expertise. For example, you can create a \" Customer Success \" profile to meet the demands of your customer-facing staff, ensuring they have the necessary access and resources to succeed. AppEQ profiles simplify operations and enable efficient task distribution across users. AppEQ profile creation serves numerous purposes: Role-based Access Control: Profiles enable you to assign particular roles and permissions to users depending on their duties and functions within the application. This guarantees that users only have access to the functions and data necessary for their task, boosting security and data integrity. Workflow Optimisation: You may streamline workflows and task assignments by defining profiles. Each profile can have predetermined settings, configurations, and responsibilities assigned to it, making it easier to onboard new users and maintain process consistency. Personalization and customization: Profiles allow you to customise the user experience depending on various roles and responsibilities. You may tailor the interface, accessible features, and displayed information to the demands of particular user groups, increasing efficiency and user satisfaction. Reporting and Analytics: Profiles aid in the generation of"
  },
  {
    "chunk_id": "a27af42f-ecd6-4695-b5ce-070a00c98ee1",
    "title": "Understanding - \"Profile in AppEQ.ai\"",
    "url": "https://help.appeq.ai/en/articles/7958000-understanding-profile-in-appeq-ai",
    "text": "process consistency. Personalization and customization: Profiles allow you to customise the user experience depending on various roles and responsibilities. You may tailor the interface, accessible features, and displayed information to the demands of particular user groups, increasing efficiency and user satisfaction. Reporting and Analytics: Profiles aid in the generation of accurate reporting and analytics by categorising people into various groups. Within each profile, you can track and analyse performance metrics, engagement levels, and user behaviour to acquire useful insights for decision-making and improvement. In general, building profiles in AppEQ increases efficiency, personalises the user experience, and allows for effective monitoring and analysis of account activity. Related Articles June'23 Release Notes Data Integration with AppEQ How to enable API Access / Permission in Salesforce July 2024 Release Notes September 2024 Release Notes"
  },
  {
    "chunk_id": "e835a3da-49bc-4df4-87bb-fdfa251d8786",
    "title": "Data Integration with AppEQ",
    "url": "https://help.appeq.ai/en/articles/8210041-data-integration-with-appeq",
    "text": "Simplified Data Integration with AppEQ.ai: Enhancing Enterprise Efficiency At the core of AppEQ.ai's product offering lies simplicity, aimed at streamlining operations and maximizing efficiency. Our Data Integration module empowers Admin users to effortlessly configure integrations with just a few clicks, facilitating seamless data flow from various enterprise applications into AppEQ. With AppEQ, users can seamlessly integrate data from a multitude of enterprise applications, ensuring a unified and holistic view of critical business information. Below, we outline the Enterprise Business Objects that are supported out of the box, along with the flexibility to configure custom business objects to meet specific organizational requirements. Below are the Enterprise Business Objects supported out of the box, on top of the custom business objects that can be configured. Business Objects Customer Accounts Opportunities / Deals Customer Tickets / Cases Customer Contacts Outstanding Invoices Net Promoter Score Product Usage Custom Business Objects How do you get data corresponding to the above supported Business objects? You can bring in data from other enterprise applications such as CRM ( Salesforce, Hubspot etc) , Helpdesk ( Zendesk, Freshdesk ) , Spreadsheet or Rest API. Permission : Only System Admin users of AppEQ can access this panel. Step1 - Navigate to the Data Settings Panel and Click on Data Source Step 2 - Click on the Connect Button Step 3 - Choose the Business Object & enter the required details Step 4 - Authorise AppEQ to access the application. On successful setup, you will get a notifcation and entry on the Data Source. The process of fetching data from the underlying system will take some time depending on the volume of data. Typically, it should be over by the next 30 mins. * Some of the enterprise applications require your to enable API Access specifically. Please refer to specific documentation"
  },
  {
    "chunk_id": "ae509e10-4661-4696-b10a-9bd52de6c543",
    "title": "Data Integration with AppEQ",
    "url": "https://help.appeq.ai/en/articles/8210041-data-integration-with-appeq",
    "text": "the Data Source. The process of fetching data from the underlying system will take some time depending on the volume of data. Typically, it should be over by the next 30 mins. * Some of the enterprise applications require your to enable API Access specifically. Please refer to specific documentation for that. Once the data connection and sync process is set up, AppEQ will check for periodic updates to give you a real time access to those data. For any challenges during setup, please drop a note to Support@AppEQ.ai Related Articles Zendesk Integration with AppEQ Hubspot CRM Integration with AppEQ AppEQ Product - Overview AppEQ Analytics SDK Integration Guide Early Warning System"
  },
  {
    "chunk_id": "1f91250e-cc88-4a86-ae41-20ae42f7f086",
    "title": "Account Custom Fields",
    "url": "https://help.appeq.ai/en/articles/8966126-account-custom-fields",
    "text": "New fields can be added to Account Business object based on specific requirements. There are 3 types of custom fields that can be added Time Series Aggregate Formula Time Series custom field category : You can make a existing account field as time series and select to have additional attributes. For example, you have a field - TotalActiveUsers which represents latest number of active users in an account and you want to see how this number of users have changed over a period of time. Then you can define a custom field - ActiveUsersTimeSeries and also select additional attribute like Last 30 days average. AppEQ server will take a daily snapshot and calculate the last 30 days average. Please note - you need to select only numeric field from the CRM. How can above field be used? This custom field can be used to show as a trend in Summary Widget or Dashboard or it can be used to configure Nudges and Playbooks like If ActiveUsersTimeSeries < (80/100) * ActiveUsersTimeSeries_Last30DaysAverage then add Task for CSM .... Related Articles Navigating Customer Success: Understanding Account Pulses vs. Account Health"
  },
  {
    "chunk_id": "16ae6554-a9a7-426d-9c85-23428abc868f",
    "title": "How to enable API Access / Permission in Salesforce",
    "url": "https://help.appeq.ai/en/articles/8210121-how-to-enable-api-access-permission-in-salesforce",
    "text": "Table of contents In order to integrate with AppEQ with Salesforce, the System Admin who is setting up the AppEQ data integration should have enabled the API Access as part of Salesforce setup. If you're a system administrator, you can easily verify or enable this setting for your users. Here's how: Navigate to Salesforce Setup: Look for the \"Setup\" menu within Salesforce. Search for User Profiles: In the top search bar, type \"Profiles\" and click on the matching option that appears below. Select the Relevant User Profile: Find the specific profile that applies to the user who needs the connection. Enable API Access: Scroll down to the \"Administrative Permissions\" section and locate the option labeled \"API Enabled.\" Make sure this box is checked. If you're not a system administrator, don't worry! Simply reach out to your admin team, and they can handle these administrative permissions steps for you. Steps to enable API access / permission in Salesforce Below 4 steps will enable apps to talk with your Salesforce instance through the API Interface. Step 1 - Got to Salesforce Admin Setup (scroll down to administrative permissions and check the api enabled box) Step 2 - Go to Administration --> Profiles and Choose the right profile to enable the API Access Step 3 - Go to System Permissions Step 4 - Search for API Enable and check the box & Save it Once done, your Salesforce instance is enabled for the API Access for that Profile. Are you a Customer Success Manager or Account Manager leveraging Salesforce to manage customer relationships? In today's competitive landscape, revenue leaders are increasingly looking at Salesforce for its potential to empower post-sales teams . While Salesforce excels in managing the sales cycle, integrating it with purpose-built customer success tools can unlock a new level of"
  },
  {
    "chunk_id": "b9ebee02-8a12-4c62-886f-799c1831c793",
    "title": "How to enable API Access / Permission in Salesforce",
    "url": "https://help.appeq.ai/en/articles/8210121-how-to-enable-api-access-permission-in-salesforce",
    "text": "Manager or Account Manager leveraging Salesforce to manage customer relationships? In today's competitive landscape, revenue leaders are increasingly looking at Salesforce for its potential to empower post-sales teams . While Salesforce excels in managing the sales cycle, integrating it with purpose-built customer success tools can unlock a new level of efficiency and functionality. This is where AppEQ steps in. We offer a lightweight plugin that seamlessly integrates with your existing Salesforce instance. Forget the hassle and expense of implementing a separate platform – AppEQ empowers you to leverage the familiarity of Salesforce while adding powerful customer success features. Here's how AppEQ enhances your Salesforce experience: Faster Time to Value: Our lightweight plugin offers a rapid integration process, allowing you to activate the power of AppEQ within your existing Salesforce workflows quickly. Seamless Data Flow: AppEQ seamlessly synchronizes data between your CRM and our platform, ensuring a unified view of your customer health and success metrics. Enhanced Functionality: Empower your team with AppEQ's advanced features designed specifically for customer success, such as automated health scores, churn risk prediction, and personalized engagement tools. By integrating AppEQ with Salesforce, you can: Proactively identify at-risk customers and take action to prevent churn. Drive higher customer satisfaction through personalized communication and proactive support. Streamline workflows and improve team efficiency. Gain deeper customer insights to inform strategic decision-making. Ready to unlock the full potential of Salesforce for your post-sales team? Related Articles Zendesk Integration with AppEQ Understanding - \"Profile in AppEQ.ai\" July'23 Release Notes Data Integration with AppEQ Dashboards"
  },
  {
    "chunk_id": "ab38047b-4a1f-4619-a4cc-37982ac576a1",
    "title": "How to enable API Access / Permission in Salesforce",
    "url": "https://help.appeq.ai/en/articles/8210121-how-to-enable-api-access-permission-in-salesforce",
    "text": "with AppEQ Dashboards"
  },
  {
    "chunk_id": "a331bceb-f27d-4615-ab88-ac9358c6055e",
    "title": "Zendesk Integration with AppEQ",
    "url": "https://help.appeq.ai/en/articles/7002983-zendesk-integration-with-appeq",
    "text": "AppEQ provides Customer 360 Views to your customer-facing teams directly on top of their existing Apps like Inbox, CRM and Helpdesk etc. AppEQ integrates with your Zendesk instance to pull the tickets details and brings to your team's Inbox both in Summarized View and Detail view. This Zendesk integration is using Zendesk's API tokens. Below are the steps to be followed for the integration. Login to your Zendesk Instance as Administrator to generate the Zendesk API token. Click the Zendesk Products icon ( ) in the top bar, then select Admin Center . In Admin Center , click Apps and integrations in the sidebar, then select APIs > Zendesk APIs . Click the Token Access toggle to enable API token access. To generate an API token, Click the Add API token button The token is generated and displayed. Enter an API token description . Copy the token and paste it somewhere secure. Once you close this window, the full token will never be displayed again. Click Save to return to the API page. Add the above Zendesk API Token in AppEQ Go to your AppEQ Dashboard at https://app.appeq.ai/ and Login After login, under the 'Data Source' Section, choose Ticket Business Object and click on the 'Add Source' icon. Choose Zendesk as your ticketing platform Enter your Zendesk Subdomain (this is part of the Zendesk URL), Zendesk Admin Email , Zendesk API Token and Click Submit Thats it! You will be able to fetch your tickets in the AppEQ Feeds Panel. To test: Click on the Feeds Icon in the AppEQ Browser Widget The AppEQ Feeds Widget will populate your Tickets from your Zendesk ​ ​ ​ ​ Related Articles Hubspot CRM Integration with AppEQ How to configure Summary Widget AppEQ Product - Overview API Ingestion Guide for AppEQ Data Integration"
  },
  {
    "chunk_id": "110da5cf-8322-4f8c-8e2b-01c720f10df3",
    "title": "Zendesk Integration with AppEQ",
    "url": "https://help.appeq.ai/en/articles/7002983-zendesk-integration-with-appeq",
    "text": "To test: Click on the Feeds Icon in the AppEQ Browser Widget The AppEQ Feeds Widget will populate your Tickets from your Zendesk ​ ​ ​ ​ Related Articles Hubspot CRM Integration with AppEQ How to configure Summary Widget AppEQ Product - Overview API Ingestion Guide for AppEQ Data Integration with AppEQ"
  },
  {
    "chunk_id": "637a6ee3-f2dd-4ffd-bcf8-674ecd21b33e",
    "title": "Hubspot CRM Integration with AppEQ",
    "url": "https://help.appeq.ai/en/articles/7004253-hubspot-crm-integration-with-appeq",
    "text": "Table of contents AppEQ provides Customer Insights to your customer-facing teams directly on top of their existing Apps like Inbox, CRM and Helpdesk etc. AppEQ integrates with your Hubspot instance to pull the CRM objects like Companies(Accounts) and Deals (Opportunities) and brings to your team's Inbox both in Summarized View and Detail view. This Hubspot integration is using Hubspot's OAuth authentication mechanism. You could follow the below video to integrate your Hubspot instance with AppEQ or follow the steps. Steps to Integrate Hubspot to AppEQ Connect your Companies Records in your Hubspot to AppEQ Go to your AppEQ Dashboard at https://app.appeq.ai/ and Login After login, to pull your ' Companies ' records from your Hubspot under the ' Data Source ' Section, choose ' Accounts ' Business Object and click on the ' Add Source ' icon. Select Hubspot as the CRM Application Click on Connect The control will take you to your Hubspot instance. Select your Hubspot Account to connect. Thats it! your Hubspot ' Companies ' records will be periodically synced in AppEQ. Connect your Deals Records in your Hubspot to AppEQ Go to your AppEQ Dashboard at https://app.appeq.ai/ and Login After login, to pull your ' Deals ' records from your Hubspot under the ' Data Source ' Section, choose ' Opportunities ' Business Object and click on the ' Add Source ' icon. Select Hubspot as the CRM Application Click on Connect The control will take you to your Hubspot instance. Select your Hubspot Account to connect. Thats it! your Hubspot ' Deals ' records will be periodically synced in AppEQ. ​ ​ Related Articles Zendesk Integration with AppEQ Data Integration with AppEQ"
  },
  {
    "chunk_id": "48125f5c-aa32-4782-893b-9aa4a563db94",
    "title": "Hubspot CRM Integration with AppEQ",
    "url": "https://help.appeq.ai/en/articles/7004253-hubspot-crm-integration-with-appeq",
    "text": "connect. Thats it! your Hubspot ' Deals ' records will be periodically synced in AppEQ. ​ ​ Related Articles Zendesk Integration with AppEQ Data Integration with AppEQ"
  },
  {
    "chunk_id": "bbdc3d78-5f34-4a8c-9526-b7b1c2aad7a5",
    "title": "AppEQ Analytics SDK Integration Guide",
    "url": "https://help.appeq.ai/en/articles/10420001-appeq-analytics-sdk-integration-guide",
    "text": "Table of contents Purpose The AppEQ Analytics SDK enables clients to capture user interactions, track events, and send this data to the AppEQ platform for analysis and insights. By following the steps outlined below, you will set up the SDK to start collecting data specific to your domain. Integration Steps Include the SDK Script Add the following script to the <head> section of your application’s HTML: <script src=\"https://app.appeq.ai/v2/sdk/tracker.min.js\"></script> Initialize the SDK Below the script tag, initialize the AppEQ Analytics SDK by adding the following code snippet: <script> _AppEQAnalyticsSDK.init({ cookieDomain: {{domain}}, // Replace with your domain, e.g., \"example.com\" apiKey: '<provided by AppEQ team>', analyticsEndpoint: 'https://api1.appeq.ai/form/analytics/storeAnalytics', userId: userId, // Replace with the user's unique email ID or identifier metadata: { // Optional: Include any additional metadata you wish to track exampleKey: 'exampleValue' } }); </script> Parameter Breakdown cookieDomain : Specify your application’s domain to associate cookies with the correct site. Example: \"example.com\" . apiKey : Use the provided API key for authentication (ensure it is kept secure and not shared). analyticsEndpoint : This is the endpoint where analytics data will be sent. Keep this unchanged unless instructed otherwise. userId : Replace this placeholder with the unique identifier for your user, such as their email address or user ID in your system. metadata : (Optional) Include any additional key-value pairs to send custom data for tracking purposes. Dynamic User ID Insertion Ensure that the userId value dynamically populates based on your application's context. For example, in a JavaScript-based web app, you might fetch the logged-in user’s email like this: const userId = getCurrentUserEmail(); // Replace with your method to retrieve the email Verify Integration Open your application in a browser. Inspect the network tab to confirm that analytics data is being sent to the endpoint ( https://api1.appeq.ai/form/analytics/storeAnalytics ). Check for any errors in"
  },
  {
    "chunk_id": "eec172f2-3e27-4708-82bc-bfff54a5d687",
    "title": "AppEQ Analytics SDK Integration Guide",
    "url": "https://help.appeq.ai/en/articles/10420001-appeq-analytics-sdk-integration-guide",
    "text": "the logged-in user’s email like this: const userId = getCurrentUserEmail(); // Replace with your method to retrieve the email Verify Integration Open your application in a browser. Inspect the network tab to confirm that analytics data is being sent to the endpoint ( https://api1.appeq.ai/form/analytics/storeAnalytics ). Check for any errors in the console and ensure all fields, especially userId , are populated correctly. Security Considerations Keep your API key confidential and avoid exposing it in publicly accessible repositories. Only use secure methods to retrieve and handle user-specific information such as userId . Support For any questions or issues regarding the integration process, please contact the AppEQ support team at support@appeq.ai . By following this guide, you will successfully integrate the AppEQ Analytics SDK, enabling your platform to capture valuable insights and improve user engagement."
  },
  {
    "chunk_id": "bbe7cc3f-2268-46e2-87d9-f29426afb10c",
    "title": "Early Warning System",
    "url": "https://help.appeq.ai/en/articles/10430205-early-warning-system",
    "text": "Table of contents With AppEQ, you can set up an Early Warning System to monitor account health based on the data you’ve integrated. For each business object, you’ll have an intuitive panel where you can define conditions that trigger accounts to be flagged as RED . How It Works You can configure rules for specific business objects (e.g., tickets) to identify potential risks. If any of the defined conditions are met, the corresponding account will be marked as RED , allowing you to take proactive action. Example Rules for the Tickets Business Object : Rule 1 : If the number of tickets in the \"Open\" stage has an average age greater than 10 days. Rule 2 : If there are any tickets with type = critical that have been open for more than 2 days. Rules can be entered in a natural language format. Some of the sample are given below tickets with stage in Open, type = critical and age > 2 days or tickets with stage in open and average age > 10 days Some of the aggregation function like age , sum, total, max, min are supported by AppEQ directly. However, please make sure that the results are properly validated by the admin. Validation and Accuracy AppEQ will automatically generate a query based on your defined rules. The system will display results for the admin to validate before saving the rule. To ensure accurate results, use the exact field names and values when setting conditions. By leveraging the Early Warning System, you can proactively address account risks, improve response times, and enhance overall customer satisfaction."
  },
  {
    "chunk_id": "ee9e7ff9-fb43-4cce-8186-e220a7a4434f",
    "title": "Early Warning System",
    "url": "https://help.appeq.ai/en/articles/10430205-early-warning-system",
    "text": "the Early Warning System, you can proactively address account risks, improve response times, and enhance overall customer satisfaction."
  },
  {
    "chunk_id": "5e2d9b44-c683-45fb-a44c-d9bb822c279a",
    "title": "October'23 Release Notes",
    "url": "https://help.appeq.ai/en/articles/8523393-october-23-release-notes",
    "text": "We are excited to announce the latest enhancements to the AppEQ platform in our October release. This update is designed to foster better integration and provide customized reporting solutions, making your workflow more intuitive and data-driven. With new Slack integration and personalized reporting features, we're bringing more flexibility and collaborative possibilities to your fingertips. As always, our goal is to evolve with your needs, ensuring a seamless and enriched user experience. Dive into the details below to learn more about the new functionalities that are now available. 1. Slack Integration: Functionality : Enhance your communication workflow with our new Slack integration. Now, you can access Slack directly from the AppEQ widget, which is also available in your inbox and wherever else you use the widget. This integration bridges the gap between your messaging channels and customer insights, making collaboration smoother and more context-driven. Channel Integration : Customize your widget by integrating up to three Slack channels, ensuring that relevant conversations are just a click away. Multi-Channel Support : Account-specific Slack icons indicate which accounts are connected to Slack, providing a clear visualization of your integrated communication channels. Salesforce Overlay : Experience the convenience of having Slack on top of Salesforce, facilitating seamless discussions around customer data. Redirect Functionality : Clicking on a channel will redirect you to the respective Slack channel, making navigation between platforms effortless. 2. My Reports: Customized Data Aggregation : With the 'My Reports' update, curate and access your crucial data all in one place. Provide us with your data preferences, and the AppEQ team will configure a custom interface tailored to your requirements. Customized Reports : Get tailored reports based on your organization's unique needs. Whether it's sales, customer engagement, or any other metric.. Easy Access : Access your customized reports right from the Extension, for"
  },
  {
    "chunk_id": "5b0f279f-3e91-41cd-a704-85853543f318",
    "title": "October'23 Release Notes",
    "url": "https://help.appeq.ai/en/articles/8523393-october-23-release-notes",
    "text": "with your data preferences, and the AppEQ team will configure a custom interface tailored to your requirements. Customized Reports : Get tailored reports based on your organization's unique needs. Whether it's sales, customer engagement, or any other metric.. Easy Access : Access your customized reports right from the Extension, for instance, from the Notes Widget, keeping all necessary information at your fingertips. Interactive Dashboard : Explore your data in-depth with the drill-down functionality on the Dashboard Report, allowing for a granular view of your metrics. User-Friendly Resizing : Adjust the dashboard view based on your preference, ensuring a user-centric experience while navigating through your reports. Related Articles June'23 Release Notes July'23 Release Notes August'23 Release Notes July 2024 Release Notes September 2024 Release Notes"
  },
  {
    "chunk_id": "b30eef9c-883b-4647-a057-f85b7d4c6261",
    "title": "August'23 Release Notes",
    "url": "https://help.appeq.ai/en/articles/8223949-august-23-release-notes",
    "text": "Table of contents Welcome to our August 2023 product update! At AppEQ, we're committed to continuously improving our platform to provide you with the most comprehensive and user-friendly customer experience tools. This month, we're thrilled to introduce several new features that have been designed to streamline your workflow, enhance data analysis, and provide more in-depth insights into your customer data. Feature 1: NPS Support from Spreadsheet We've made it easier than ever to calculate your Net Promoter Score (NPS) directly from your spreadsheet. With the new function fxNPS , you can now generate a summary for an account's NPS over the last 12 months. This function, highlighted in blue for easy identification, automates the NPS calculation process, saving you time and ensuring accuracy. To help you understand the calculation process, we've added an information tooltip that links to a detailed explanation of how NPS is calculated. You can find this information in our blog post here . Additionally, we've introduced an NPS trend feature that displays the NPS trend over the past 12 months, providing you with a clear picture of your performance over time. Feature 2: AppEQ Genie Introducing AppEQ Genie, powered by Bard AI. This feature allows you to ask any question about your customers or potential customers, and get accurate, data-driven responses. Whether you need to know about customer preferences, behavior, or potential opportunities, AppEQ Genie is here to assist. (Genie, can be accessed from the Gmail Inbox) Feature 3: Addition of Customer Accounts Made Easier We've streamlined the process of adding customer accounts. Now, you can add customer accounts directly from the Summary Widget. You can also designate accounts as Champions or Sponsors for more organized tracking. If a data source is already configured, an icon will appear allowing you to add the account to your"
  },
  {
    "chunk_id": "d509b1d4-dc05-49ad-87c2-e40d4afb9ed9",
    "title": "August'23 Release Notes",
    "url": "https://help.appeq.ai/en/articles/8223949-august-23-release-notes",
    "text": "streamlined the process of adding customer accounts. Now, you can add customer accounts directly from the Summary Widget. You can also designate accounts as Champions or Sponsors for more organized tracking. If a data source is already configured, an icon will appear allowing you to add the account to your Watch List with just one click. Feature 4: Third-Party & AppEQ Data We've expanded our data-sourcing capabilities. Given a domain, we can now provide you with a wealth of information, including the company description, logo image, LinkedIn URL, HQ city, country, latest news, employee size, and revenue (if available). This data is sourced from reliable third-party platforms like Crunchbase and BardAI. For organizations frequently used by AppEQ users, we will update the latest news, employee size, and revenue data on a monthly basis. (It can be viewed on the summary widget) Feature 5: Feed Update We've added the ability to set Account Pulse directly from your Feed. This new feature allows you to keep a close eye on the pulse of your accounts, ensuring you never miss a beat when it comes to managing your customer relationships. We hope these updates will enhance your experience and provide you with the tools you need to better understand and engage with your customers. As always, we welcome your feedback and look forward to continuing to serve your needs. Feature 6: Tasks / To-Do Accessibility We've made it even easier for users to access their tasks and to-dos. With the introduction of the Success Pad, users can now effortlessly add tasks they need to perform and check them off once completed. A dedicated widget will display any unmarked tasks, ensuring you never miss out on any important action items. Feature 7: Account Status Modification We've made it even easier for users to access"
  },
  {
    "chunk_id": "095425ca-a087-4e58-adbb-9b25d548141a",
    "title": "August'23 Release Notes",
    "url": "https://help.appeq.ai/en/articles/8223949-august-23-release-notes",
    "text": "Success Pad, users can now effortlessly add tasks they need to perform and check them off once completed. A dedicated widget will display any unmarked tasks, ensuring you never miss out on any important action items. Feature 7: Account Status Modification We've made it even easier for users to access their tasks and to-dos. With the introduction of the Success Pad, users can now effortlessly add tasks they need to perform and check them off once completed. A dedicated widget will display any unmarked tasks, ensuring you never miss out on any important action items. Feature 8: Nudges for Pulse Stay on top of your tasks with our new Nudges feature. This functionality sends you timely reminders, nudging you to set a pulse at custom intervals determined by you. Moreover, notifications have been enhanced to include action buttons wherever relevant, streamlining your workflow and ensuring you take immediate action. As we continue to innovate and evolve, we're excited to see how these new features will empower you to better understand, engage with, and serve your customers. We believe that these updates will bring you closer to your customers and help you achieve your business goals more effectively. We appreciate your continued support and feedback, which are invaluable in helping us shape the future of AppEQ. Stay tuned for more updates and enhancements in the coming months, as we strive to make AppEQ your go-to platform for customer experience management. Thank you for being a part of our journey. Related Articles June'23 Release Notes July'23 Release Notes October'23 Release Notes July 2024 Release Notes September 2024 Release Notes"
  },
  {
    "chunk_id": "c488859c-e125-41fc-aed4-ed610f0af8b1",
    "title": "August'23 Release Notes",
    "url": "https://help.appeq.ai/en/articles/8223949-august-23-release-notes",
    "text": "June'23 Release Notes July'23 Release Notes October'23 Release Notes July 2024 Release Notes September 2024 Release Notes"
  },
  {
    "chunk_id": "363444cb-380c-4ea7-8693-5d6098f805b3",
    "title": "July'23 Release Notes",
    "url": "https://help.appeq.ai/en/articles/8140647-july-23-release-notes",
    "text": "We are thrilled to announce some exciting updates to the AppEQ platform, designed to enhance your experience and empower your business success. Our latest features bring you valuable insights and seamless integration, enabling you to make data-driven decisions and drive customer success. Here's a closer look at the July release: API Update: Streamline Data Integration With our new API functionality, AppEQ customers can now send the 'product value levers' metric through an API interface. This means you can easily sync your custom software with AppEQ, ensuring seamless integration and data synchronization. By sending the 'product value levers' metric every hour or day, you gain valuable data for nudges, account dashboard visibility, priority feed, and account summary features. With streamlined data integration, you can unlock powerful insights and drive proactive account actions. Click here for more details on how to go about API Ingestion Account Pulse: Gauge Account Health We are introducing Account Pulse, a powerful feature that allows you to gauge the health of your accounts. You can now use pulse in Red Accounts, enabling you to record touch points and categorize them based on their nature. The visual setup of the pulse allows you to view and deduce the overall health of each account easily. By tracking touch points and differentiating between red, orange, and green, you gain a comprehensive understanding of your account's status, enabling you to take proactive actions to retain and nurture your valuable customers. Summary on Inbox & Other Locations: Convenient Access to Information To provide you with seamless access to account summaries, we have made several updates to their visibility. First, we have implemented a default summary to be shown whenever there is no associated summary. This ensures that you always have key information at hand, even in the absence of a specific summary."
  },
  {
    "chunk_id": "f3b54573-6742-4b11-8732-1170dd48e413",
    "title": "July'23 Release Notes",
    "url": "https://help.appeq.ai/en/articles/8140647-july-23-release-notes",
    "text": "provide you with seamless access to account summaries, we have made several updates to their visibility. First, we have implemented a default summary to be shown whenever there is no associated summary. This ensures that you always have key information at hand, even in the absence of a specific summary. Additionally, the summary is now accessible even when an email is opened, allowing you to quickly reference important details without leaving your inbox. We have also made the summary contextually available on top of Salesforce and HubSpot, integrating it directly into your workflow. However, we are actively addressing an issue regarding the loading time of summaries, aiming to reduce it to just 2 seconds for a smoother user experience. Lastly, the summary is now contextually available on top of calendar.google.com, enabling you to access vital information while managing your calendar effortlessly. We are confident that these updates will significantly improve your experience with AppEQ, providing you with powerful tools to optimise your business strategies and drive customer success.To help you visualise these enhancements, here are some accompanying screenshots showcasing the new features: At AppEQ, we are dedicated to meeting your evolving needs and ensuring your success in the B2B SaaS space. We value your partnership and remain committed to continuously improving our platform. If you have any questions or need further assistance, please don't hesitate to reach out to our dedicated support team. Related Articles June'23 Release Notes August'23 Release Notes October'23 Release Notes July 2024 Release Notes November 2024 Release Notes"
  },
  {
    "chunk_id": "09ac3c5b-050d-43b1-a977-aefb22d9cdbf",
    "title": "July'23 Release Notes",
    "url": "https://help.appeq.ai/en/articles/8140647-july-23-release-notes",
    "text": "Release Notes"
  },
  {
    "chunk_id": "6233a95e-2c9e-4e3f-9023-037b191adfe3",
    "title": "June'23 Release Notes",
    "url": "https://help.appeq.ai/en/articles/8039836-june-23-release-notes",
    "text": "Welcome, where we're thrilled to share the latest enhancements and features added to our product. This update brings a range of exciting improvements, including a new feed user interface, enhanced task management capabilities, advanced spreadsheet integration, personalized nudges, priority sorting, and consistent tabular formats. We've been listening to your feedback and working tirelessly to deliver a product that meets your evolving needs. Read on to discover how these updates will revolutionize your experience with our product. New Features and Bug Fixes: Priority Feeds: A Streamlined Approach to Account Management We understand that efficient account management is crucial for your success. To address this, we have implemented a new feed user interface that provides a holistic view of your account summary and to-do list. This streamlined approach allows you to access critical information, track tasks, and monitor account health directly from your feeds, enabling you to stay on top of your priorities effortlessly. Enhanced Task Management with To-Do List : Managing tasks effectively is essential for maximising productivity. With our enhanced task management system, you now have the power to create, edit, and assign tasks to other users seamlessly. Whether you're working individually or collaborating with a team, our intuitive interface and comprehensive functionality will empower you to stay organised and accomplish your goals efficiently. Furthermore, we have integrated HubSpot tasks, allowing you to consolidate your task management across platforms, ensuring a cohesive workflow. Advanced Spreadsheet Integration: Connect and Analyze Data with Ease We recognize the importance of data integration in your workflow. With the new \"Spread-Sheet by sheet name\" feature, you gain greater flexibility and control over your data analysis. Now, you can effortlessly connect to a specific sheet within your spreadsheets through AppEQ, providing a seamless data integration experience. This enhancement enables you to extract valuable insights and make"
  },
  {
    "chunk_id": "2983b880-d773-413e-baf2-9ea36297043d",
    "title": "June'23 Release Notes",
    "url": "https://help.appeq.ai/en/articles/8039836-june-23-release-notes",
    "text": "your workflow. With the new \"Spread-Sheet by sheet name\" feature, you gain greater flexibility and control over your data analysis. Now, you can effortlessly connect to a specific sheet within your spreadsheets through AppEQ, providing a seamless data integration experience. This enhancement enables you to extract valuable insights and make informed decisions based on the data that matters most to you. Personalized Nudges for Enhanced Customer Engagement : We believe in the power of personalization. To strengthen your customer relationships, we have introduced the option to send nudges exclusively to the user’s selected by you. By leveraging this feature, known as \"Nudge Based on Account Domain,\" you can tailor your communications and outreach efforts to focus on your most important accounts. This personalized approach enables you to nurture relationships effectively, increasing customer satisfaction and engagement. Priority Sorting: Focus on What Matters Most In a fast-paced business environment, it's essential to prioritize your activities effectively. With our priority sorting feature, accounts in your feeds will now be sorted based on their health status. The highest priority accounts, indicated by the red status, will appear at the top, ensuring that you can quickly identify and address critical issues. This enhancement streamlines your workflow, enabling you to optimize your time and resources efficiently. Improved UI and Flow for Creating Summaries: We believe that simplicity and efficiency go hand in hand. To facilitate effortless summary creation, we have revamped the user interface and flow. With the new flow, selecting summaries is more intuitive and user-friendly. This enhancement streamlines your workflow, allowing you to generate insightful summaries with ease. By enhancing data visualization and actionability, we empower you to make informed decisions Related Articles AppEQ Product - Overview July'23 Release Notes August'23 Release Notes October'23 Release Notes July 2024 Release Notes"
  },
  {
    "chunk_id": "4bb3bbc7-ac61-46c3-99ca-fa861abc1b59",
    "title": "June'23 Release Notes",
    "url": "https://help.appeq.ai/en/articles/8039836-june-23-release-notes",
    "text": "user-friendly. This enhancement streamlines your workflow, allowing you to generate insightful summaries with ease. By enhancing data visualization and actionability, we empower you to make informed decisions Related Articles AppEQ Product - Overview July'23 Release Notes August'23 Release Notes October'23 Release Notes July 2024 Release Notes"
  },
  {
    "chunk_id": "56b9359b-3d59-4593-a460-e4e414131768",
    "title": "July 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10383309-july-2024-release-notes",
    "text": "Table of contents Imagine having a personal assistant, data wizard, and productivity guru all rolled into one, without the coffee breaks! That’s exactly what Workbench delivers. Managing accounts, tracking renewals, and uncovering product insights can feel overwhelming without the right tools. Workbench is here to change that, providing you with a centralized command center to simplify your day and supercharge your customer success efforts. Say hello to Workbench , the newest addition to AppEQ.ai! Designed for multitasking superheroes and data ninjas alike, Workbench empowers you to track, manage, and succeed- all while making your workflow smarter and faster. 2. What is the Workbench Feature? Workbench is a customizable command center that consolidates your key account data, task management, and insights into a single, user-friendly dashboard. It’s the ultimate tool for streamlining workflows and boosting productivity. ​ Key Benefits: ​ Centralized Data Access: All your account details in one place, just a click away. Customizable Dashboard: Tailor Workbench to your workflow. Enhanced Team Collaboration: Assign tasks, track progress, and stay synchronized. ​ Curious about product usage trends? Just one click on the Product Usage Widget , and voilà- instant insights! 3. Why is Workbench Important? Teams often face challenges such as: Time wasted juggling multiple tools and tabs. Lack of visibility into critical account data. Missed opportunities for collaboration and proactive management. Workbench addresses these pain points by: Saving time with instant access to all relevant data. Streamlining workflows with a customizable dashboard. Empowering smarter, data-driven decisions for better outcomes. 4. Key Features of Workbench Personalized Welcome Messages: Start your day with a warm, customized greeting, like a high-five from your favorite teammate. Comprehensive Data Overview: Access critical account information at a glance, including: Account Name Renewal Dates Total & Pending Tickets Invoice Amount ARR/MRR Product Usage Trends (accessible with a"
  },
  {
    "chunk_id": "f412e23c-bd8d-46b1-9a93-436455b5e7ca",
    "title": "July 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10383309-july-2024-release-notes",
    "text": "Key Features of Workbench Personalized Welcome Messages: Start your day with a warm, customized greeting, like a high-five from your favorite teammate. Comprehensive Data Overview: Access critical account information at a glance, including: Account Name Renewal Dates Total & Pending Tickets Invoice Amount ARR/MRR Product Usage Trends (accessible with a single click). ​ Customizable Dashboard: Rearrange and prioritize widgets to suit your workflow and focus on what matters most. Seamless Team Collaboration: Assign tasks, monitor progress, and work together effortlessly. Integrated Insights: Pull data from multiple systems into one unified view to eliminate information scavenger hunts. Effortless Reporting: Generate reports with just one click—it’s as simple as that. ​ 5. How to Use Workbench Access Key Data: Use the dashboard to track account details, renewal dates, tickets, and product usage trends. Collaborate Effectively: Assign tasks to your team and monitor their completion. Generate Reports: Create comprehensive reports in seconds to share insights. Stay Proactive: Use real-time updates and alerts to stay ahead of critical account events.. ​ 6. Use Cases Real-World Scenarios: Retention Management: Monitor renewal dates and engage customers before contracts expire. Issue Resolution: Track tickets and ensure timely responses to improve customer satisfaction. Upsell Opportunities: Identify high product usage accounts ripe for expansion. Team Coordination: Assign tasks and monitor progress for seamless collaboration. ​ 7. Metrics and Results Potential Outcomes: Time Savings: Reduce manual data gathering and tab switching. Improved Account Management: Stay proactive with real-time alerts and insights. Increased Efficiency: Boost productivity with streamlined workflows and faster reporting. ​ ​ ​ Ready to Rule Your World? Dive into Workbench today and transform the way you work! Visit AppEQ.ai to get started. From tracking renewals to uncovering product trends, Workbench has everything you need to shine. Because smarter work is faster work. Please refer to the video below"
  },
  {
    "chunk_id": "c399c160-6aef-48e3-875c-737be3b1a29e",
    "title": "July 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10383309-july-2024-release-notes",
    "text": "reporting. ​ ​ ​ Ready to Rule Your World? Dive into Workbench today and transform the way you work! Visit AppEQ.ai to get started. From tracking renewals to uncovering product trends, Workbench has everything you need to shine. Because smarter work is faster work. Please refer to the video below for a clearer understanding of the Smart Slides feature. ​ Attachment icon Smart Workbench.mp4 Related Articles June'23 Release Notes September 2024 Release Notes August 2024 Release Notes October 2024 Release Notes November 2024 Release Notes"
  },
  {
    "chunk_id": "e240ffe1-b753-43a3-9f2b-c25e11cbde64",
    "title": "August 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10410472-august-2024-release-notes",
    "text": "Table of contents Did you know that 89% of customers will switch to a competitor after just one poor experience? Staying ahead of potential issues is critical to retaining your customers and driving growth. Tracking account health can be a challenge. Missed opportunities, unresolved issues, or slipping engagement can snowball into bigger problems, leaving your team reactive instead of proactive. Enter Signals , the latest upgrade to AppEQ.ai. This powerful early warning system is designed to spotlight at-risk accounts, flag critical moments, and let you take action before problems escalate. With Signals, you can ensure every issue, opportunity, and “oh no!” moment is caught before it impacts your customer relationships. 2. What is the Signals Feature? Signals is a customizable early warning system that identifies and flags key account conditions - from overdue invoices to unresolved tickets and declining product usage. By monitoring these critical moments, it helps teams take proactive steps to maintain strong customer relationships. Key Benefits: Customizable Rules: Tailor conditions that matter most to your business. Real-Time Alerts: Stay informed about critical moments as they happen. Proactive Engagement: Address at-risk accounts before it’s too late. 3. Why is Signals Important? Problem-Solution Fit: Teams often struggle with: Lack of visibility into account health. Missed opportunities for upselling or retention. Reactive management instead of proactive engagement. Impact: Signals empowers your team to stay ahead of the curve by: Highlighting risks before they become problems. Boosting retention rates through timely engagement. Simplifying account monitoring to reduce manual effort. 4. Key Features of Signals Customizable Rules for Key Business Objects: Define conditions to track overdue invoices, unresolved tickets, low product usage, and more. Monitor critical aspects like Net Promoter Score, customer health index, and engagement levels. Red Alerts for Critical Moments: Instantly flag accounts that meet your defined conditions. Enable teams"
  },
  {
    "chunk_id": "c2186b84-1a77-4f3a-8c39-6673e08b488e",
    "title": "August 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10410472-august-2024-release-notes",
    "text": "Features of Signals Customizable Rules for Key Business Objects: Define conditions to track overdue invoices, unresolved tickets, low product usage, and more. Monitor critical aspects like Net Promoter Score, customer health index, and engagement levels. Red Alerts for Critical Moments: Instantly flag accounts that meet your defined conditions. Enable teams to act fast and minimize churn. Effortless Setup: Configure and edit conditions through an intuitive interface—no coding required. Comprehensive Account Health Tracking: Monitor contacts, customers, invoices, product usage, opportunities, and more. 5. How to Use Signals Set Up Health Criteria: Define the conditions most relevant to your business. ​ ​ ​ 2. Monitor Alerts: Stay informed about flagged accounts through real-time notifications. ​ 3. Take Proactive Action: Use insights to engage with at-risk accounts, resolve issues, and seize opportunities. ​ 6. Use Cases Real-World Scenarios: Retention: Detect early signs of churn by tracking declining engagement or unresolved issues. Upsell Opportunities: Identify accounts with high product usage or positive sentiment ready for expansion. Customer Success Planning: Prioritize accounts for personalized outreach and QBRs. 7. Metrics and Results Potential Outcomes: Improved Net Revenue Retention (NRR): Engage at-risk accounts to boost retention. Reduced Churn Rates: Resolve issues before they escalate. Increased Upsell Success: Spot opportunities for growth and act on them. Ready to Get Started? Visit the Signals section in AppEQ.ai to configure conditions for your business today. From overdue invoices to low engagement, Signals ensures nothing slips through the cracks. Because the best way to solve a problem is to see it coming. ​ Related Articles AppEQ Product - Overview Navigating Customer Success: Understanding Account Pulses vs. Account Health July 2024 Release Notes October 2024 Release Notes November 2024 Release Notes"
  },
  {
    "chunk_id": "e07aecb5-f092-45bd-b149-b9f162024502",
    "title": "August 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10410472-august-2024-release-notes",
    "text": "coming. ​ Related Articles AppEQ Product - Overview Navigating Customer Success: Understanding Account Pulses vs. Account Health July 2024 Release Notes October 2024 Release Notes November 2024 Release Notes"
  },
  {
    "chunk_id": "08ebf4a1-4de8-4e4e-8008-7279827f1258",
    "title": "September 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10398125-september-2024-release-notes",
    "text": "Table of contents Ever feel like your inbox is more of a chore than a tool? What if you could make it your productivity playground instead? Writing and managing emails can be repetitive and time-consuming. From digging up attachments to reusing the same greetings, it’s easy to feel stuck. Enter Email Assist , your inbox sidekick that makes crafting emails fast, fun, and impressive. With Email Assist , you’re not just sending emails; you’re creating masterpieces. Think of it as the ultimate email hack- combining efficiency with creativity to transform your email workflow into a productivity powerhouse. ​ What is the Email Assist Feature? Definition: Email Assist is a powerful tool that streamlines email creation with customizable templates, easy attachment handling, and built-in metrics integration. It helps you craft personalized, professional emails in less time. ​ Key Benefits: Save Time: Eliminate repetitive tasks and focus on impactful communication. Enhance Creativity: Use ready-made templates and metrics to create impressive emails. Boost Productivity: Manage your inbox effortlessly with a one-click email widget. ​ Key Features of Email Assist Custom Email Templates: Create a library of stylish, reusable templates to fit any occasion. Save time while maintaining a consistent and professional tone. ​ Effortless Attachment Handling: Quickly add reports, decks, or even memes with a simple click. ​ Metrics Hub Integration: Include NPS scores, product stats, and other data points with ease. Transform emails into data-rich communications that make an impact. ​ Personalization Made Easy: Combine the power of templates with your unique voice for tailored emails. ​ One-Click Email Widget: Select a template, customize it, and hit send- all with minimal effort. ​ How to use Email Assists? Build Your Template Library: Create and save custom templates for different use cases. ​ Attach Files in a Flash: Drag and drop or click"
  },
  {
    "chunk_id": "ef7436f7-1127-474f-a819-f4ee3fef334a",
    "title": "September 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10398125-september-2024-release-notes",
    "text": "voice for tailored emails. ​ One-Click Email Widget: Select a template, customize it, and hit send- all with minimal effort. ​ How to use Email Assists? Build Your Template Library: Create and save custom templates for different use cases. ​ Attach Files in a Flash: Drag and drop or click to add files to your email effortlessly. Add Personal Touches: Customize templates with your voice to keep emails authentic. Send with One Click: Use the email widget to finalize and send your emails in seconds. ​ ​ Click on email widget, choose a template. Add the recipient's email ID, CC's, include any customizations needed and Hit \"SEND\". ​ ​ Use Cases Real-World Scenarios: Client Outreach: Send polished, personalized emails to nurture relationships. Data-Driven Updates: Share metrics and insights with clients or stakeholders. Team Collaboration: Quickly communicate project updates or assign tasks. Customer Success: Respond to inquiries with impactful, professional replies. Metrics and Results Time Savings: Dramatically reduce the time spent on repetitive email tasks. Improved Engagement: Send emails that resonate with recipients and prompt responses. Increased Efficiency: Manage communication more effectively with streamlined workflows. Ready to Revolutionize Your Inbox? Transform your email game with Email Assist today. Schedule a demo to see how it can level up your communication and make your inbox the happiest place on Earth. Because every email deserves to be a masterpiece. Related Articles Email Assist July 2024 Release Notes November 2024 Release Notes"
  },
  {
    "chunk_id": "06b26fa1-366c-43be-bafc-082ca6f6112b",
    "title": "October 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10410774-october-2024-release-notes",
    "text": "Table of contents Hey there, CXOs! 🎉 Welcome to the brand new CXO Dashboard on AppEQ.ai – the ultimate tool to track, measure, and celebrate your company's performance like never before. This isn't just another dashboard – it's your personalized command center, where every bar graph and table is ready to give you insights that matter. Ready to dive in? Let’s explore what we've got for you: 1. Revenue Growth – Where the Money Moves 💸 The Revenue Growth section is like your personal crystal ball, showing you the highs (and the very highs!) of your company’s revenue trends. This section serves up monthly breakdowns of: MoM Growth (Month-over-Month) Expansion MRR (because more revenue means more happiness!) New Sales MRR (new beginnings, new possibilities) Retained MRR (because keeping customers is as important as getting them) This part of the dashboard gives you all the details you need to stay on top of the money-making game with easy-to-read bar graphs and percentage breakdowns over the past year. 📈 ​ 2. Retention & Expansion – Grow, Keep, Repeat 🌱 Retention isn’t just about keeping customers – it’s about expanding your empire. This section shows how well you're nurturing your existing customers while growing the base: GRR % (Gross Revenue Retention) Expansion MRR (your business is spreading like wildfire!) Resurrected MRR (because second chances are golden) Renewed MRR (keeping the subscription dreams alive) With monthly insights, you’ll get a clear view of how you're expanding and keeping those customers engaged with your brand. It's growth at its finest, visualized! 📊 ​ 3. Churn Trend – Bye-Bye to the Old, Hello to the New 👋 Let’s be real – every business faces churn. But don’t worry, we've got your back. This section helps you track those customers who decided to move on: Churned MRR"
  },
  {
    "chunk_id": "a33aa291-a258-4b3a-b9b6-386b5b5d738e",
    "title": "October 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10410774-october-2024-release-notes",
    "text": "It's growth at its finest, visualized! 📊 ​ 3. Churn Trend – Bye-Bye to the Old, Hello to the New 👋 Let’s be real – every business faces churn. But don’t worry, we've got your back. This section helps you track those customers who decided to move on: Churned MRR (we’ll miss them, but it’s all part of the process) Contracted MRR (cutting down on the extra weight) Churn Rate (because knowledge is power) It’s all about seeing the trends and figuring out what’s driving those changes – so you can act fast, adjust, and keep the churn at bay. 📉 ​ 4. CXO - MRR Expansion Chart What it shows: Ah, the sweet spot: Expansion MRR . This chart takes you on a journey through the power of customer retention and growth, showing how NRR , Resurrected MRR , and Expansion MRR evolve month by month. Think of it as your roadmap to business growth, with key expansions lighting the way! NRR Resurrected MRR Expansion MRR By the end of the year, you’ll be able to spot where your biggest wins are coming from, all through a series of snazzy bars that show exactly how your business is expanding! 🌟📈 ​ 5. MRR Table – The Monthly Breakdown, Made Easy 🗓️ This isn’t just a table – it’s your monthly guide to MRR madness, packed with details to make sure you're not missing a thing. Here’s what it includes: Month MoM Growth NRR (Net Revenue Retention) GRR Starting & Ending MRR Retained, Expansion, Resurrected, Churned, Contracted MRR New Sales MRR It’s a complete, detailed table that allows you to look at the nuts and bolts of your MRR every month. Perfect for those who want to dive deep into the numbers and see exactly where the magic (and the"
  },
  {
    "chunk_id": "79710215-dba1-4658-a21f-30fb0e693093",
    "title": "October 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10410774-october-2024-release-notes",
    "text": "Ending MRR Retained, Expansion, Resurrected, Churned, Contracted MRR New Sales MRR It’s a complete, detailed table that allows you to look at the nuts and bolts of your MRR every month. Perfect for those who want to dive deep into the numbers and see exactly where the magic (and the challenges) are happening. ​ 🌟 Customizability at Your Fingertips Here’s the real magic: this dashboard is completely customizable ! Tailor every metric, graph, and table to match your specific goals and KPIs. Need to track a new metric? Done! Want to change the view? Double done. Your dashboard, your rules. 🎨 ​ Why You’ll Love It : Trendy, Monthly Insights : You get detailed, month-by-month insights into the metrics that matter most. Fully Customizable : Every data point is flexible to match your exact needs – no more generic dashboards! Easy to Read, Easy to Act On : Visuals that speak your language, and data that tells the story of your business. Track Performance Like a Pro : Perfect for CXOs who need to stay on top of revenue, churn, retention, and expansion with real-time updates. So, grab your virtual coffee and start exploring your new CXO Dashboard on AppEQ.ai. Get ready to track, analyze, and conquer the business world, one graph at a time. 💼📈 Related Articles July 2024 Release Notes August 2024 Release Notes Dashboards"
  },
  {
    "chunk_id": "6342c011-ebeb-4494-a31d-01834cb5ab9a",
    "title": "November 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10454994-november-2024-release-notes",
    "text": "1. Introduction Did you know that CSMs spend an average of 6-8 hours creating slides for Quarterly Business Reviews (QBRs) and Monthly Business Reviews (MBRs)? What if you could automate that process and cut your time down to minutes? Customer Success Managers juggle multiple tasks, and creating insightful, visually appealing slides for meetings often takes up a significant portion of their time. With constant pressure to present data in a digestible way and tailor insights to individual customer needs, manual slide creation can quickly become a bottleneck. The Smart Slides feature in AppEQ.ai is here to change that. Imagine having a tool that automatically generates customized slides for your QBRs, MBRs, or any other customer-facing presentations. With Smart Slides, you can focus more on strategic conversations with customers and less on formatting and slide creation. ​ 2. What is the Smart Slides Feature? Smart Slides is an AI-powered tool within the AppEQ.ai platform that automates the creation of presentation slides for customer meetings. Using data insights, it generates slides that are relevant, accurate, and tailored to the specific needs of each customer or account. ​ Key Benefits: Time Savings: Generate fully designed slides in minutes instead of hours. Customization: Automatically tailor slides based on customer data and KPIs. Data-Driven: Incorporates real-time account health and sentiment data to present meaningful insights. Consistency: Ensures each slide is up-to-date and aligned with the most recent metrics, so you don’t have to manually adjust data. ​ ​ ​ 3. Why is Smart Slides Important? Many CSMs are overwhelmed with the amount of time it takes to manually create presentations that accurately reflect account performance. Smart Slides addresses this by eliminating repetitive tasks and helping you stay focused on the customer experience rather than slide formatting. Lack of Time: CSMs often spend an average of"
  },
  {
    "chunk_id": "1d44d009-2094-4fc8-a74d-ecf28756f7f3",
    "title": "November 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10454994-november-2024-release-notes",
    "text": "Many CSMs are overwhelmed with the amount of time it takes to manually create presentations that accurately reflect account performance. Smart Slides addresses this by eliminating repetitive tasks and helping you stay focused on the customer experience rather than slide formatting. Lack of Time: CSMs often spend an average of 6-8 hours creating QBR and MBR slides. Manual Effort: Repetitive data entry and slide design can lead to mistakes or inconsistency. Customer-Facing Efficiency: With Smart Slides, you can save time while still impressing customers with data-driven, visually compelling presentations. Impact: By freeing up valuable time, Smart Slides empowers CSMs to spend more time on relationship-building, proactive account management, and strategic decision-making. It also ensures the presentations are aligned with customer goals, driving better engagement and retention. ​ 4. Key Features of Smart Slides AI-Powered Design: The system uses AI to automatically generate slide content based on account data, customer sentiment, and KPIs. You no longer need to start from scratch or worry about formatting. Customizable Templates: Tailor the look and feel of your slides with customizable templates that match your brand, allowing for both uniformity and personalization. Real-Time Data Integration: Smart Slides pulls in real-time data directly from your AppEQ.ai account or integrated CRMs, ensuring the slides are always up to date with the latest insights. Interactive Slide Features: Slides can include clickable elements like charts, graphs, and other visualizations that make the data more engaging and easier for customers to understand. ​ ​ 5. How to Use Smart Slides Step 1: Set Up Data Sources Connect AppEQ.ai to your CRM or data platform to ensure seamless data flow into your slides. Step 2: Access Smart Slides on AppEQ.ai Step 2: Choose from the templates you want to work on. Choose whether you're creating slides for a QBR, MBR, or"
  },
  {
    "chunk_id": "c2d53187-6f11-458f-bcf6-3dc059514067",
    "title": "November 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10454994-november-2024-release-notes",
    "text": "Step 1: Set Up Data Sources Connect AppEQ.ai to your CRM or data platform to ensure seamless data flow into your slides. Step 2: Access Smart Slides on AppEQ.ai Step 2: Choose from the templates you want to work on. Choose whether you're creating slides for a QBR, MBR, or any other customer-facing session. Select from Pre-built templates or choose to create you own slides. ​ Step 3: Customize Your Slides Customize your slide layout and design based on the customer’s needs and choose from the snapshots that are already generated in the \"General\" MetricsHub. ​ Step 4: Review & Edit You can also choose the customer for which the snapshot for different metrics has to be generated - NPS score, product usage etc. The AI will generate snapshots that can be added to your slides, but you can always tweak them to highlight specific insights or focus areas. ​ Step 5: Present with Confidence Download or present your slides directly from the platform, knowing they’re tailored to the exact data points that matter to the customer. You can even share the slides directly to your customer through our email option. ​ ​ 6. Use Cases Retention: Quickly identify at-risk accounts by pulling in health scores and sentiment data into slides, enabling you to highlight areas for improvement or celebrate recent wins. Upsell Opportunities: Use customer data to highlight areas where your customer could benefit from new features or products, identifying natural expansion opportunities. Customer Success Planning: Organize your QBR or MBR by aligning the slides with customer goals and KPIs, ensuring you’re prepared to provide valuable recommendations during your meetings. ​ 7. Metrics and Results Time Savings: CSMs can reduce the time spent creating slides by up to 90%, freeing up hours for more value-added tasks. Improved Customer Engagement:"
  },
  {
    "chunk_id": "c65ff6e2-637b-47ef-a4ba-307a15f49a19",
    "title": "November 2024 Release Notes",
    "url": "https://help.appeq.ai/en/articles/10454994-november-2024-release-notes",
    "text": "or MBR by aligning the slides with customer goals and KPIs, ensuring you’re prepared to provide valuable recommendations during your meetings. ​ 7. Metrics and Results Time Savings: CSMs can reduce the time spent creating slides by up to 90%, freeing up hours for more value-added tasks. Improved Customer Engagement: Real-time data presentation makes it easier to have meaningful conversations, leading to stronger relationships and better retention rates. Increased Operational Efficiency: With more time spent on strategy and less on administrative tasks, CSMs can improve their overall productivity and impact on customer success outcomes. Incorporating Smart Slides into your workflow makes QBRs and MBRs less time-consuming and more effective, so your team can focus on what truly matters: driving customer success. Please refer to the video below for a clearer understanding of the Smart Slides feature. ​ Attachment icon Smart Slides.mp4 Related Articles July 2024 Release Notes September 2024 Release Notes August 2024 Release Notes October 2024 Release Notes Dashboards"
  },
  {
    "chunk_id": "ff9edd9b-0b0b-42f1-b749-abeb8fa71596",
    "title": "API Ingestion Guide for AppEQ",
    "url": "https://help.appeq.ai/en/articles/8145852-api-ingestion-guide-for-appeq",
    "text": "This document outlines how to use our API to manage various business objects. It includes instructions on authentication, data ingestion, token expiration, error handling, and rate and size limits. Base URL: 🔗 api1.appeq.ai Authentication Login Endpoint To access the API, you need to log in and get a token. URL: /auth/login Method: POST Request Body: { \"username\": \"your_username\", \"password\": \"your_password\" } Response : { \"token\": \"your_token\", \"refresh_token\": \"your_refresh_token\", \"expires_in\": 172800 // Token lasts for 2 days (172800 seconds) } Steps to Follow: Send a POST request to /auth/login with your username and password. You will receive a token and a refresh token in the response. Use this token for authenticated requests to the API. Refresh Token Endpoint To keep using the API after your token expires, you need to refresh it. URL: /auth/refresh Method: POST Request Body: { \"refresh_token\": \"your_refresh_token\" } Response: { \"token\": \"your_new_token\", \"expires_in\": 172800 // New token lasts for 2 days (172800 seconds) } Steps to Follow: Send a POST request to /auth/refresh with your refresh token. You will receive a new token in the response. Use this new token for authenticated requests to the API. Ingest Data for Business Object Single Data Object You can add a single data object to the API. URL: /data/ingest Method: POST Headers: Authorization: Bearer {token} Request Body: { \"object_type\": \"account\", // Type of data: \"account\", \"order\", \"ticket\" \"primary_key\": \"account_id\", // Primary key field \"data\": { \"account_id\": \"12345\", \"account_domain\": \"example.com\", \"additional_field_1\": \"value1\", \"additional_field_2\": \"value2\" } } Response: { \"message\": \"Data ingested successfully\", \"code\": 201, \"created_columns\": [\"account_id\", \"account_domain\", \"additional_field_1\", \"additional_field_2\"] } Steps to Follow: Send a POST request to /data/ingest with the required headers and request body. Include your token in the headers. Include the type of data, primary key, and data object in the request body. You will receive a confirmation"
  },
  {
    "chunk_id": "ca5012e5-25c7-4538-a72a-e84568536d6a",
    "title": "API Ingestion Guide for AppEQ",
    "url": "https://help.appeq.ai/en/articles/8145852-api-ingestion-guide-for-appeq",
    "text": "successfully\", \"code\": 201, \"created_columns\": [\"account_id\", \"account_domain\", \"additional_field_1\", \"additional_field_2\"] } Steps to Follow: Send a POST request to /data/ingest with the required headers and request body. Include your token in the headers. Include the type of data, primary key, and data object in the request body. You will receive a confirmation message in the response. Bulk Data You can add multiple data objects at once. URL: /data/ingest Method: POST Headers: Authorization: Bearer {token} Request Body: { \"object_type\": \"orders\", \"primary_key\": \"orderId\", \"data\": [ { \"account_id\": \"12345\", \"account_domain\": \"example.com\", \"orderId\": \"234567654\", \"additional_field_1\": \"value1\", \"additional_field_2\": \"value2\" }, { \"account_id\": \"12345\", \"account_domain\": \"example.com\", \"orderId\": \"234567657\", \"additional_field_1\": \"value1\", \"additional_field_2\": \"value2\" }, { \"account_id\": \"12346\", \"account_domain\": \"example1.com\", \"orderId\": \"234567655\", \"additional_field_1\": \"value1\", \"additional_field_2\": \"value2\" } ] } Response: { \"message\": \"Data ingested successfully\", \"code\": 201, \"created_columns\": [\"account_id\", \"account_domain\", \"additional_field_1\", \"additional_field_2\"] } Steps to Follow: Send a POST request to /data/ingest with the required headers and request body. Include your token in the headers. Include the type of data, primary key, and an array of data objects in the request body. You will receive a confirmation message in the response. Token Expiration Tokens are valid for 30 days (2592000000 seconds), this is configurable. After expiration, refresh the token using the /auth/refresh endpoint. Steps to Follow: Track the expiration time of your token. Before the token expires, send a POST request to /auth/refresh with your refresh token to get a new token. Use the new token for further API requests. Error Handling The API handles errors and provides detailed error responses. Error Response Example: { \"error\": \"error_type\", \"message\": \"error_message\", \"status_code\": status_code, \"details\": {} } Steps to Follow: If an error occurs, check the error response from the API. The response includes an error type, message, status code, and additional details. Use this information to understand and resolve the issue. Rate"
  },
  {
    "chunk_id": "5cd21253-fc4d-4619-844f-c1849b573ba6",
    "title": "API Ingestion Guide for AppEQ",
    "url": "https://help.appeq.ai/en/articles/8145852-api-ingestion-guide-for-appeq",
    "text": "responses. Error Response Example: { \"error\": \"error_type\", \"message\": \"error_message\", \"status_code\": status_code, \"details\": {} } Steps to Follow: If an error occurs, check the error response from the API. The response includes an error type, message, status code, and additional details. Use this information to understand and resolve the issue. Rate Limiting and Size Limiting Rate Limiting You can make 1 request per second with each API key. If you exceed this limit, you'll get a 503 status code. Steps to Follow: Ensure your requests do not exceed 1 per second. If you receive a 503 status code, slow down your requests. Size Limiting Request payloads can't exceed 1 MB. For bulk data ingestion, you can send up to 500 objects. Response for Exceeding Limits: { \"error\": \"PayloadTooLarge\", \"message\": \"Request payload exceeds the 1 MB limit.\", \"code\": 413 } Steps to Follow: Ensure your request payloads are within the 1 MB limit. For bulk data, ensure you are sending no more than 500 objects. If you receive a 413 status code, reduce the size of your payload and try again."
  }
]