[
  {
    "title": "AppEQ Product - Overview",
    "url": "https://help.appeq.ai/en/articles/8019840-appeq-product-overview",
    "content": "AppEQ product can be broadly broken down into below features. \nFeature\nDescription\nWidgets\nWidgets as UI components that get activated on top of your existing applications to help your team to get contextual access to data, insights and action items for your customer accounts. \n \nAppEQ support 3 widgets - Summary, Feed and SuccessPad. \n \nData\nThis helps in getting enterprise data from your existing system like CRM, Helpdesk, Spreadsheet to be sync with AppEQ so that you can use them for designing the widget and signals. \n \nYou can also configure derived data based on existing data. \nSignals\nSignals are notifications and tasks that helps your team to be proactive. You can configure nudges notification and play-books for your team based on certain condition. \n \nConfiguration of right signals enable your team to be more proactive and improve the odds for higher revenue retention and growth. \n \nWidgets\nSummary Widget\n   : This widget helps you to configure crisp executive summary of the account which can be useful for your customer success managers or account managers. \n \nFeed Widget\n : This widget helps you to see filtered list of items like open tickets, pending invoices etc. \nPriority Accounts Feed \n: This help your team to understand the list of priority accounts for the day. It allows CSM or AM to understand which accounts to focus from their portfolio of accounts.\nIt is a widget which can be activated on web applications where CSM or AM already works on.\nThrough this, a CSM when he/she starts the day, will see their accounts based on the priority and nudges associated with the account.\nThis will  help CSM to focus on accounts which require proactive focus.\n​\n \nFiltered List \n: This helps to see and access data across accounts by each business object. E.g - List of all the open P1 issues in my accounts.  \nNudges\n : List of items which I need to look at , applicable for a given condition. \n \nSuccessPad Widget\n: This is a draggable widget which can be enabled on web applications where you team works currently. This will give them access to data and insights for their accounts. \n \n \nData\n \nData Source\n: Data source are applications which store information to understand for customer accounts. E.g - If you use a CRM like Salesforce, it become a good source of data to understand opportunities, engagement etc.  Similarly - a Helpdesk software like Zendesk becomes a good source to understand customer account from support perspective. \n \nYou can configure to connect your enterprise applications to connect with AppEQ to have real-time sync with the systems to understand customer insights. \nCRM - Salesforce, Hubspot \nHelpdesk - Zendesk, Freshdesk, Hubspot \nGoogle Spreadsheet \nAPI Interface - your team can send account metrics through AppEQ api at regular interval. \n \nCustom Field\n:  You can also define custom fields based on formula. E.g - Annual Non Recurring Revenue = TCV - ARR \n \nSignals \nAccount Red Condition\n: Based on the data source configured, you can configure threshold to understand RED accounts. \n \nNudges Notification\n:  Based on account scenario, you can configure notifications so that your team will not miss the right events of critical accounts. \n \n \nNudges Playbook\n:  Based on account scenario, you can not only configure notifications but also add TODOs for the account. \n \n \n \n \n \n \n \n \n \nRelated Articles\nAugust'23 Release Notes\nAccount Custom Fields\nEmail Assist\nNavigating Customer Success: Understanding Account Pulses vs. Account Health\nGetting Started"
  },
  {
    "title": "Dashboards",
    "url": "https://help.appeq.ai/en/articles/10511549-dashboards",
    "content": "Table of contents\nExploring AppEQ's NoSQL-Powered Dashboard\n \n1. Introduction\nAppEQ's dashboard is designed to help \nCustomer Success, Revenue, and Operations teams\n gain \nreal-time insights\n into key business metrics without requiring extensive data expertise. By leveraging \nNoSQL (MongoDB)\n and \nMetabase-powered visualizations\n, AppEQ provides a seamless, self-service analytics experience.\n \nWith AppEQ, teams can:\nMonitor customer health, revenue trends, and product adoption\nVisualize data in multiple chart formats\nReduce manual effort in preparing reports for QBRs and internal meetings\nLeverage AI-driven insights for proactive decision-making\nThis document introduces NoSQL, explains AppEQ’s data dictionary, and outlines the supported visualizations to help users make the most of their data.\n \n2. Understanding NoSQL and MongoDB\n \nWhat is NoSQL?\nNoSQL databases are designed to handle \nlarge-scale, unstructured, or semi-structured data\n in a flexible manner. Unlike relational databases (SQL), which use fixed schemas, NoSQL databases like \nMongoDB\n allow dynamic and scalable data storage.\n \nWhy MongoDB for AppEQ?\nAppEQ uses \nMongoDB\n, a document-based NoSQL database, due to its:\nScalability\n – Handles large data sets efficiently.\nFlexibility\n – Supports dynamic schema structures.\nReal-time capabilities\n – Enables instant data visualization.\nJSON-like document storage\n – Simplifies integration with external data sources.\nFor a deeper dive into NoSQL and MongoDB:\nMongoDB Official Documentation\nIntroduction to NoSQL Databases\n \n3. AppEQ's Quick Chart & Data Dictionary \n \nQuick Chart Feature\nAppEQ's \nQuick Chart\n feature enables teams to generate visualizations effortlessly using natural language inputs. This eliminates the need for SQL or NoSQL query writing, making data insights accessible to non-technical users.\n \nHow Quick Chart Works\nUsers enter a query in plain language, such as:\n\"Give me a trend of tickets for the account Tesla for the last 3 months.\"\nAppEQ translates this input into the necessary NoSQL query.\nThe generated query retrieves data from MongoDB.\nThe appropriate visualization (e.g., a line chart for trends) is displayed on the dashboard.\nBenefits of Quick Chart\nTime-Saving\n: Eliminates the need for manual query writing.\nUser-Friendly\n: Allows non-technical users to access data insights.\nAccuracy\n: Ensures consistency in data retrieval and visualization.\nSeamless Integration\n: Works across different business data sources.\n \nWhat is a Data Dictionary?\nA \ndata dictionary\n provides a structured overview of the \nbusiness objects\n and their corresponding \nfields\n that AppEQ pulls from external sources like CRM, billing, and support systems. This ensures consistent data mapping for visualization. \n \nKey Business Objects & Sample Fields\nBusiness Object\nSource\nSample Fields\nCustomer Account\nCRM (HubSpot, Salesforce)\nAccount Name, MRR, ARR, Owner, Industry\nProduct Usage\nAnalytics (Mixpanel, Amplitude)\nActive Users, Feature Adoption, Session Duration\nSupport Tickets\nHelpdesk (Zendesk, Freshdesk)\nTicket ID, Priority, Status, Resolution Time\nFinancial Data\nBilling (Chargebee, Stripe)\nSubscription Plan, Payment Status, Renewal Date\nThis structured approach enables teams to \nquickly extract insights\n without manually aggregating data.\n \n4. Supported Visualizations in AppEQ’s Dashboard\nAppEQ’s dashboard is powered by \nMetabase\n, offering a variety of chart types to help teams analyze data effectively.\n \nSupported Chart Types\nChart Type\nUse Case\n📊 \nBar Chart\nCompare MRR growth, churn trends, or feature adoption rates\n📈 \nLine Chart\nTrack customer health scores, revenue expansion, or retention trends\n🥧 \nPie Chart\nVisualize customer segments, issue categories, or renewal statuses\n🍩 \nDonut Chart\nSimilar to pie chart but with an inner hole for emphasis\n📉 \nArea Chart\nShow cumulative trends like user growth over time\n📑 \nTable View\nDisplay detailed account, usage, or support data in tabular format\n📊 \nCombo Chart\nCombine multiple data series (bar + line) for deeper insights\n📌 \nFunnel Chart\nAnalyze customer journey stages from onboarding to renewal\n📡 \nRadar Chart\nCompare multiple variables like CSAT, NPS, and response times\nFor more details on Metabase visualizations:\nMetabase Visualization Documentation\n \n5. \nHow to Leverage the AppEQ Dashboard for Customer Retention, Upsell, and Cross-Sell Insights\n \nStep-by-Step Guide\nConnect external data sources\n (e.g., HubSpot, Salesforce, Mixpanel, Zendesk).\nChoose a visualization type\n based on the insights you need.\nApply filters\n (e.g., revenue by region, churn by industry, active users by product feature).\nCustomize dashboard layouts\n to suit team-specific needs.\nExport charts and reports\n for \nQBRs, executive presentations, or department meetings\n.\nBy automating report generation, \nteams save time and improve decision-making\n with accurate, real-time data.\n \n6. Advantages of Using AppEQ’s NoSQL Dashboard\n✅ \nReal-time updates\n – No need for manual data exports. \n✅ \nSelf-service analytics\n . \n✅ \nScalability\n – Handles large datasets from multiple sources. \n✅ \nCustomization\n – Tailor dashboards for different teams (CS, Leaders, CSOps / SalesOps). \n✅ \nEasy integrations\n – Works with HubSpot, Salesforce, Zendesk, Chargebee, Mixpanel, and more.\n \n7. Next Steps\n \nAppEQ’s \nNoSQL-powered dashboard\n is designed to empower teams with \nreal-time insights\n, eliminating the complexity of traditional BI tools. By integrating data from multiple sources and supporting a variety of visualizations, AppEQ enhances \ndata-driven decision-making\n for \nCustomer Success, Revenue, and Operations teams\n. \n \nFor advanced visualizations or complex joins, you may need to write NoSQL queries to achieve the desired results. If you need assistance, our team of experts is always available to guide you through the process.\n \n \nNext Steps:\n📘 \nLearn More\n: Explore AppEQ’s Knowledge Base.\n📩 \nGet Support\n: Contact \nsupport@appeq.ai\n for custom dashboard requirements.\n \nRelated Articles\nOctober 2024 Release Notes\nNovember 2024 Release Notes"
  },
  {
    "title": "Account Summary Feature",
    "url": "https://help.appeq.ai/en/articles/8290039-account-summary-feature",
    "content": "Related Articles\nSuccessPad Feature\nMy Tasks Feature"
  },
  {
    "title": "SuccessPad Feature",
    "url": "https://help.appeq.ai/en/articles/8290046-successpad-feature",
    "content": "SuccessPad consolidates data from various applications into a single interface for seamless workflow management. With SuccessPad, you can access all account-related information, tasks, and insights in one place, eliminating the need to switch between multiple applications. You can customize the interface, set up early warning systems, and integrate different applications effortlessly. \n \nTake proactive actions, simplify your workflow, and enhance productivity with SuccessPad! \n \n \n \n \n \nRelated Articles\nJuly 2024 Release Notes\nDashboards"
  },
  {
    "title": "My Tasks Feature",
    "url": "https://help.appeq.ai/en/articles/8290066-my-tasks-feature",
    "content": "Related Articles\nAccount Summary Feature"
  },
  {
    "title": "Email Assist",
    "url": "https://help.appeq.ai/en/articles/9013085-email-assist",
    "content": "Email Assist feature helps Customer account owners to engage with customers over email with the right template assistance based on the email to be sent. \n \nFor example, you would want to make a playbook to ensure that your CSM / AM sends out a Birthday greetings to all the budget owners with a hyper personalized email. \n \n \nEmail Templates : \n \nTemplates can be defined by admin or manager to standardise some of the email engagement. Such templates will be available to the CSM/AMs to assist them while sending out email to customer. \n \nThere are 2 types of email templates that are supported. \nStatic Templates with Variables\nHyper Personalized CGPT Templates with Variables \n \nStatic Templates\nStatic templates are mostly static text which can be used to send out some of the standard customer communications. E.g - Sending out email reminder for pending invoice. \n \nSubject\n: Reminder: Outstanding Invoice Payment Due  \n \nDear {firstName},\nI hope this email finds you well. I am reaching out to remind you about the outstanding invoice for {productName}, which is currently overdue.\nAs your dedicated Account Manager, I understand the importance of ensuring that all financial matters are promptly addressed to maintain a smooth and mutually beneficial partnership. The invoice in question was due on {dueDate}, and we have yet to receive payment.\nPlease kindly review your records and prioritize the settlement of this invoice at your earliest convenience. If you require any assistance or have any questions regarding the payment process, please do not hesitate to reach out to me directly.\nThank you for your attention to this matter, and I look forward to your prompt action.\nThanks and Regards,\n \n \nHyper Personalized CGPT Templates\nCGPT templates are used to hyper personalize an email sent to a customer. Below is one example of a CGPT template for sending out a B'day greeting. \n \nGenerate a email to wish a birthday for a customer with below details\nName : {firstName}\nBirthday : {birthday} \nLocation : {city} \nProfile : {profileTags} \nTone: Formal\n \n \nThe above templates can be used by the CSM from AppEQ widgets manually or through Nudges & Playbook tasks automation."
  },
  {
    "title": "Setting Early Warning System with AppEQ",
    "url": "https://help.appeq.ai/en/articles/9524936-setting-early-warning-system-with-appeq",
    "content": "An effective early warning system allows your team to focus on strategic tasks while automatically monitoring potential issues that could impact account health. It helps you identify and address problems before they escalate, improving customer satisfaction and reducing churn.\n \nSetting up your early warning system:\nAppEQ allows you to configure alerts for various metrics that indicate potential issues. Here are some examples of early warning signals you can set up:\n \n1. Ticket volume and priority: Be alerted when the number or severity of support tickets increases beyond a set threshold.\n2. Customer responsiveness: Get notified if a customer hasn't responded to communications within a specified timeframe.\n3. Business review schedule: Receive reminders when business reviews are overdue.\n4. Key stakeholder changes: Be informed when a customer champion leaves the company or changes roles.\n5. Usage patterns: Set alerts for significant drops in usage, no usage, or usage below the median for similar accounts.\n \nRemember, the key to an effective early warning system is finding the right balance. Set thresholds that catch genuine issues without overwhelming your team with false alarms.\n \nWith AppEQ's Early Warning System, you'll always stay one step ahead, ensuring your customers receive timely attention and support when they need it most.\n \nRelated Articles\nSuccessPad Feature\nNavigating Customer Success: Understanding Account Pulses vs. Account Health\nJuly 2024 Release Notes\nAugust 2024 Release Notes\nEarly Warning System"
  },
  {
    "title": "Creating Playbooks with AppEQ",
    "url": "https://help.appeq.ai/en/articles/9524928-creating-playbooks-with-appeq",
    "content": "Playbooks ensure consistency, efficiency, and best practices across your entire customer success operation. They provide a structured approach to common scenarios, allowing your team to deliver a uniform, high-quality experience to every customer.\n \nWhen should you create a playbook?\nCreate playbooks for recurring processes or situations that require a standardized approach. This could be at various stages of the customer lifecycle or for specific events that impact customer health and satisfaction.\n \nTypes of playbooks you can create:\n1. Customer Onboarding Playbook: Guide new customers through a smooth setup process.\n2. Kickoff Playbook: Ensure a strong start to new customer relationships.\n3. Business Review Playbook: Prepare and conduct effective periodic reviews.\n4. NPS Review Playbook: Respond appropriately to customer feedback.\n \nBy implementing playbooks, you ensure that all Customer Success Managers (CSMs) follow tried-and-tested best practices, leading to improved customer satisfaction and retention.\n \n \nRelated Articles\nJune'23 Release Notes\nAugust'23 Release Notes\nEmail Assist\nNavigating Customer Success: Understanding Account Pulses vs. Account Health\nNovember 2024 Release Notes"
  },
  {
    "title": "Navigating Customer Success: Understanding Account Pulses vs. Account Health",
    "url": "https://help.appeq.ai/en/articles/9874287-navigating-customer-success-understanding-account-pulses-vs-account-health",
    "content": "Table of contents\nMastering Customer Success with Account Pulses and Account Health\n \nIn the world of Customer Success, understanding your clients' experiences, needs, and challenges is key to driving long-term relationships and success. But how do you capture the pulse of a client’s journey while staying on top of potential risks? This is where Account Pulses and Account Health come into play - two powerful tools that offer actionable insights to elevate your customer management strategies. Let’s take a closer look at these concepts and how they work together to ensure proactive, personalized customer success.\nAccount Pulses: Capturing the Human Element\nAccount Pulses\n are subjective indicators set by Customer Success Managers (CSMs) based on their day-to-day interactions and conversations with clients. Think of them as a quick temperature check- an intuitive, color-coded system that reflects the current sentiment or mood of an account. These pulses typically include the following color classifications:\nGreen\n: Indicates positive product usage and feedback.\nAmber\n: Suggests caution or potential issues.\nRed\n: Signals significant concerns or low engagement.\nPurple\n: Customizable, used for specific internal purposes.\n​\n \n \n \nWhat makes Account Pulses unique is their ability to capture nuances in the customer journey that raw data might overlook. For instance, if a client is experiencing reduced product usage due to external market changes, the CSM can manually update the pulse to yellow, even if other engagement metrics are strong. This flexibility allows CSMs to adapt conversations and strategies in real-time to better support the client’s evolving needs.\n \nIn essence, \nAccount Pulses offer a momentary, human-centered snapshot\n of the client’s experience. They allow CSMs to keep their finger on the pulse (pun intended) and stay connected to the emotional and experiential aspects of the customer journey.\n \n \n \nAccount Health: Data-Driven Risk Management\nWhile Account Pulses provide a qualitative, emotional view of customer sentiment, \nAccount Health\n is a more structured, automated assessment based on predefined, data-driven metrics. Account Health evaluates whether an account meets certain health criteria, offering a more objective view of customer engagement and satisfaction.\n \nCommon metrics used in determining Account Health include:\n \n- \nProduct usage\n: Frequency and depth of usage over time.\n- \nLogin activity\n: Days since the customer last logged in.\n- \nNet Promoter Score (NPS)\n: Customer feedback and satisfaction score.\n- \nSupport tickets:\n Number and severity of open issues or requests.\n \nFor instance, if a customer hasn’t logged into the platform for over seven days or their NPS score drops below a set threshold, their Account Health might be flagged as \"red,\" signaling that the account requires immediate attention. This automated, data-centric approach ensures \nconsistency and accuracy\n in evaluating the status of an account, allowing CSMs to identify at-risk customers before issues escalate.\n \n \n \n \n \nThe Power of Combining Account Pulses and Account Health\nThe real magic happens when \nAccount Pulses\n and \nAccount Health\n work together. By combining the subjective insights from Account Pulses with the objective, data-driven analysis of Account Health, CSMs gain a \nholistic view\n of each customer’s journey. \n \n- \nAccount Pulses\n allow for real-time, personalized adjustments based on direct communication with the client, ensuring that the CSM stays attuned to the emotional side of customer experience.\n- \nAccount Health\n provides a consistent framework for tracking key performance indicators, identifying risks, and predicting potential churn before it’s too late.\n \nBy leveraging both tools, CSMs can \ntailor customer success strategies\n more effectively offering personalized support to clients while addressing data-driven risks.\n \nProactive Customer Management: The Key to Long-Term Success\nIn today’s competitive landscape, a reactive approach to customer success just won’t cut it. Organizations need to be proactive in managing customer relationships, and that’s where Account Pulses and Account Health shine. By regularly monitoring these two key indicators, CSMs can stay ahead of potential challenges, fostering stronger relationships and ultimately driving customer loyalty.\n \nTo ensure long-term success, CSMs should:\n- Regularly review Account Health to track customer engagement and detect early warning signs.\n- Maintain close communication with clients to adjust Account Pulses and gain deeper insights into their experience.\n- Use both qualitative and quantitative data to shape customer success strategies, ensuring a balanced approach.\n \nConclusion: Elevating Customer Success with Data and Empathy\nAccount Pulses\n and \nAccount Health\n are indispensable tools in the world of customer success. They empower CSMs to balance the art and science of customer management—combining data with empathy to provide personalized, proactive support. By harnessing the power of both, organizations can enhance customer satisfaction, reduce churn, and foster long-term success for their clients.\n \nUltimately, understanding and utilizing Account Pulses and Account Health allows CSMs to elevate their customer management efforts and build lasting relationships that drive real, measurable business outcomes.\n \nRelated Articles\nJuly'23 Release Notes\nHow to enable API Access / Permission in Salesforce\nAugust'23 Release Notes\nAugust 2024 Release Notes\nNovember 2024 Release Notes"
  },
  {
    "title": "How to configure Summary Widget",
    "url": "https://help.appeq.ai/en/articles/7046828-how-to-configure-summary-widget",
    "content": "Configure your Summary Widget\nLogin to \nhttps://app.appeq.ai/\nGo to the \nWidget\n Section\nClick on the \nNext\n Button\nAdd Items\n to your summary Widget\nChoose from your Business Objects coming from Integrated Apps\nFor instance, Tickets from Zendesk have Functions to summarize at the Customer Account level\nFor instance, Customer Invoices from a Google Sheet have Functions to summarize at the Customer Account level\nYou can set the \nLabel\n for Items\nsave your changes\nOnce the Summary Widget is configured, you will start seeing the summary in the following Apps, basis your configuration.\n \nSummary Widget in your Existing Apps\nYou can fetch the Summary on click on the Logo in the Feeds view\nOn-click on the Customer Account Logo\nThe summary Widget Pops up\nYou can fetch the Customer Summary on top of your Inbox\nOn-hover over the Health Icon with the Customer email\nThe summary Widget Pops up\nYou can fetch the Summary on top of your Apps like SFDC\nOn-click on the Health Icon on your Customer Account Page on SFDCemail\nThe summary Widget Pops up"
  },
  {
    "title": "Understanding - \"Profile in AppEQ.ai\"",
    "url": "https://help.appeq.ai/en/articles/7958000-understanding-profile-in-appeq-ai",
    "content": "When it comes to managing applications, efficiency and tailored user experiences are paramount for success. AppEQ, our innovative platform, introduces a powerful tool called \"Profiles\" that allows businesses to organise and customise information for different user groups. In this article, we will explore what Profiles are in AppEQ and how they offer distinct summaries, empowering teams such as Customer Success, Finance, and Sales to access the information most relevant to their roles while keeping it separate from other profiles.\n \nWhat is \"\nProfile\n\" in AppEQ?\n \nA \"\nProfile\n\" in AppEQ refers to a distinct group or cohort that defines specific roles for users within the application. These profiles aid in the definition and assignment of responsibilities to various employees depending on their functions and expertise. \n \nFor example, you can create a \"\nCustomer Success\n\" profile to meet the demands of your customer-facing staff, ensuring they have the necessary access and resources to succeed. AppEQ profiles simplify operations and enable efficient task distribution across users.\n \n \n \n \nAppEQ profile creation serves numerous purposes:\n \nRole-based Access Control:\n Profiles enable you to assign particular roles and permissions to users depending on their duties and functions within the application. This guarantees that users only have access to the functions and data necessary for their task, boosting security and data integrity.\n \nWorkflow Optimisation:\n You may streamline workflows and task assignments by defining profiles. Each profile can have predetermined settings, configurations, and responsibilities assigned to it, making it easier to onboard new users and maintain process consistency.\n \nPersonalization and customization: \nProfiles allow you to customise the user experience depending on various roles and responsibilities. You may tailor the interface, accessible features, and displayed information to the demands of particular user groups, increasing efficiency and user satisfaction.\n \nReporting and Analytics:\n Profiles aid in the generation of accurate reporting and analytics by categorising people into various groups. Within each profile, you can track and analyse performance metrics, engagement levels, and user behaviour to acquire useful insights for decision-making and improvement.\n \nIn general, building profiles in AppEQ increases  efficiency, personalises the user experience, and allows for effective monitoring and analysis of account activity.\n \nRelated Articles\nJune'23 Release Notes\nData Integration with AppEQ\nHow to enable API Access / Permission in Salesforce\nJuly 2024 Release Notes\nSeptember 2024 Release Notes"
  }
]